<?xml version="1.0"?>
<net name="Model3" version="11">
	<layers>
		<layer id="10" name="x" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="phones">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="x_lengths" type="Parameter" version="opset1">
			<data shape="1" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="phones_length">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="sid" type="Parameter" version="opset1">
			<data shape="1" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="speakers">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="tone" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="tones">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="language" type="Parameter" version="opset1">
			<data shape="1,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="lang_ids">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="bert" type="Parameter" version="opset1">
			<data shape="1,1024,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="bert">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="ja_bert" type="Parameter" version="opset1">
			<data shape="1,768,?" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="ja_bert">
					<dim>1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="noise_scale" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="noise_scale">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="length_scale" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="length_scale">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="noise_scale_w" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="noise_scale_w">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="sdp_ratio" type="Parameter" version="opset1">
			<data shape="1" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="sdp_ratio">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="__module.model/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="12" name="__module.model.enc_p/aten::arange/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="13" name="Constant_4290531" type="Const" version="opset1">
			<data element_type="i8" shape="112, 192" offset="4" size="21504" />
			<output>
				<port id="0" precision="I8">
					<dim>112</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Convert_4290532" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>112</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Constant_4290533" type="Const" version="opset1">
			<data element_type="f32" shape="112, 1" offset="21508" size="448" />
			<output>
				<port id="0" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="__module.model.enc_p.emb/aten::embedding/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>112</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>112</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>112</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="__module.model.enc_p.emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="__module.model.enc_p.emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="19" name="__module.model.enc_p.emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>112</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="104">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Constant_4290535" type="Const" version="opset1">
			<data element_type="i8" shape="11, 192" offset="21956" size="2112" />
			<output>
				<port id="0" precision="I8">
					<dim>11</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Convert_4290536" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>11</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>11</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Constant_4290537" type="Const" version="opset1">
			<data element_type="f32" shape="11, 1" offset="24068" size="44" />
			<output>
				<port id="0" precision="FP32">
					<dim>11</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="__module.model.enc_p.tone_emb/aten::embedding/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>11</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>11</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>11</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="__module.model.enc_p.tone_emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="__module.model.enc_p.tone_emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="26" name="__module.model.enc_p.tone_emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>11</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="106">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="__module.model.enc_p/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="107">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Constant_4290539" type="Const" version="opset1">
			<data element_type="i8" shape="4, 192" offset="24112" size="768" />
			<output>
				<port id="0" precision="I8">
					<dim>4</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Convert_4290540" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>4</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Constant_4290541" type="Const" version="opset1">
			<data element_type="f32" shape="4, 1" offset="24880" size="16" />
			<output>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="__module.model.enc_p.language_emb/aten::embedding/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>4</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>4</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="__module.model.enc_p.language_emb/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="__module.model.enc_p.language_emb/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="34" name="__module.model.enc_p.language_emb/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>4</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="109">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="__module.model.enc_p/aten::add/Add_1" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="110">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="bert/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="24896" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="37" name="bert/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="24900" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="38" name="bert/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="24896" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="39" name="bert/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="24900" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="40" name="bert/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Constant_4290543" type="Const" version="opset1">
			<data element_type="i8" shape="192, 1024, 1" offset="24904" size="196608" />
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Convert_4290544" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Constant_4290545" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1" offset="221512" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="__module.model.enc_p.bert_proj/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="__module.model.enc_p.bert_proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1024</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="__module.model.enc_p.bert_proj/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="222280" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="__module.model.enc_p.bert_proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="93">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="__module.model.enc_p/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="223048" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="__module.model.enc_p/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="94,bert_emb">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="__module.model.enc_p/aten::add/Add_2" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="111">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="ja_bert/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="52" name="ja_bert/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="223060" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="53" name="ja_bert/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="54" name="ja_bert/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="223060" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="55" name="ja_bert/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Constant_4290547" type="Const" version="opset1">
			<data element_type="i8" shape="192, 768, 1" offset="223064" size="147456" />
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Convert_4290548" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Constant_4290549" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1" offset="370520" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>768</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>768</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="371288" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="__module.model.enc_p.ja_bert_proj/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="101">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="__module.model.enc_p/aten::transpose/ScatterElementsUpdate_1" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="223048" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="__module.model.enc_p/aten::transpose/Transpose_1" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="102,ja_bert_emb">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="__module.model.enc_p/aten::add/Add_3" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="112">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Constant_614752" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="372056" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="__module.model.enc_p/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="113">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="__module.model.enc_p/aten::transpose/ScatterElementsUpdate_2" type="Const" version="opset1">
			<data element_type="i32" shape="3" offset="223048" size="12" />
			<output>
				<port id="0" precision="I32">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="__module.model.enc_p/aten::transpose/Transpose_2" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>-1</dim>
					<dim>192</dim>
				</port>
				<port id="1" precision="I32">
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="114,x.3">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="ShapeOf_639233" type="ShapeOf" version="opset3">
			<data output_type="i64" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I64">
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Constant_639234" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="372060" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="72" name="Constant_639235" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="372068" size="8" />
			<output>
				<port id="0" precision="I64" />
			</output>
		</layer>
		<layer id="73" name="Gather_639236" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="I64">
					<dim>3</dim>
				</port>
				<port id="1" precision="I64" />
				<port id="2" precision="I64" />
			</input>
			<output>
				<port id="3" precision="I64" names="115" />
			</output>
		</layer>
		<layer id="74" name="__module.model.enc_p/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="372076" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="75" name="__module.model.enc_p/aten::arange/Range" type="Range" version="opset4">
			<data output_type="i64" />
			<input>
				<port id="0" precision="I32" />
				<port id="1" precision="I64" />
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="I64" names="116,x.5">
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="47" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="372068" size="8" />
			<output>
				<port id="0" precision="I64" names="47" />
			</output>
		</layer>
		<layer id="77" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="117">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="48" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="372080" size="8" />
			<output>
				<port id="0" precision="I64" names="48" />
			</output>
		</layer>
		<layer id="79" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="I64" names="118">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="__module.model.enc_p/aten::lt/Less" type="Less" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="I64">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="119">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="__module.model.enc_p/aten::unsqueeze/Unsqueeze_2" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="BOOL" names="120">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="__module.model.enc_p/aten::to/Convert" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="BOOL">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="121,1301,x_mask.1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="49" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="372060" size="8" />
			<output>
				<port id="0" precision="I64" names="49" />
			</output>
		</layer>
		<layer id="84" name="__module.model.enc_p.encoder/aten::unsqueeze/Unsqueeze" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="172,2392">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="__module.model/aten::arange/Constant_1" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="0" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="86" name="__module.model.enc_p/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="122,x.7">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="__module.model.enc_p.encoder/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="175,x.17">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="69" type="Const" version="opset1">
			<data element_type="i64" shape="" offset="372088" size="8" />
			<output>
				<port id="0" precision="I64" names="69" />
			</output>
		</layer>
		<layer id="89" name="__module.model.enc_p.encoder/aten::unsqueeze/Unsqueeze_1" type="Unsqueeze" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64" />
			</input>
			<output>
				<port id="2" precision="FP32" names="173">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="__module.model.enc_p.encoder/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="174,mask.1">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Constant_614753" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="0" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="__module.model.enc_p.encoder.attn_layers.0/aten::eq/Equal" type="Equal" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="BOOL" names="1007,1191,264,448,639,823">
					<dim>1</dim>
					<dim>1</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="__module.model.enc_p.encoder.attn_layers.0/aten::masked_fill/ConvertLike" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372096" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="94" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution/fq_input_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372100" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="95" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution/fq_input_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372104" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="96" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution/fq_input_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372100" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="97" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution/fq_input_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372104" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="98" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_4290551" type="Const" version="opset1">
			<data element_type="i8" shape="192, 192, 1" offset="372108" size="36864" />
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Convert_4290552" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Constant_4290553" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1" offset="408972" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="409740" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.enc_p.encoder.attn_layers.0.conv_q/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="188,query.1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="Constant_652232" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="410508" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.enc_p.encoder.attn_layers.0/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="209">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="108" name="__module.model.enc_p.encoder.attn_layers.0/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="410540" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="__module.model.enc_p.encoder.attn_layers.0/aten::transpose/Transpose" type="Transpose" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I32">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="210,query.3">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_614754" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1, 1" offset="410556" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="217,231">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="410560" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="113" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="410564" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="114" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="410560" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="115" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="410564" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="116" name="__module.model.enc_p.encoder.attn_layers.0/aten::div/Divide/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution/fq_input_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372100" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="118" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution/fq_input_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372104" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="119" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution/fq_input_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372100" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="120" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution/fq_input_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="372104" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="121" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution/fq_input_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="Constant_4290555" type="Const" version="opset1">
			<data element_type="i8" shape="192, 192, 1" offset="410568" size="36864" />
			<output>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="Convert_4290556" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="124" name="Constant_4290557" type="Const" version="opset1">
			<data element_type="f32" shape="192, 1, 1" offset="447432" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="125" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="126" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Convolution" type="Convolution" version="opset1">
			<data strides="1" dilations="1" pads_begin="0" pads_end="0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>192</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="127" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Reshape" type="Const" version="opset1">
			<data element_type="f32" shape="1, 192, 1" offset="448200" size="768" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="195,key.1">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="448968" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="130" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="448972" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="131" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="448968" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="132" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="448972" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="133" name="__module.model.enc_p.encoder.attn_layers.0.conv_k/aten::_convolution/Add/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="134" name="Constant_652233" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="410508" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="135" name="__module.model.enc_p.encoder.attn_layers.0/aten::view/Reshape_1" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>192</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="212,218">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="136" name="__module.model.enc_p.encoder.attn_layers.0/aten::matmul/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="false" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>96</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>2</dim>
					<dim>96</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="219,scores.1">
					<dim>1</dim>
					<dim>2</dim>
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="137" name="self.model.enc_p.encoder.attn_layers.0.emb_rel_k" type="Const" version="opset1">
			<data element_type="f32" shape="1, 9, 96" offset="448976" size="3456" />
			<output>
