[UNK]:100
[CLS]:101
[SEP]:102
!:106
':112
,:117
-:118
.:119
?:136
a:143
b:144
c:145
d:146
e:147
f:148
g:149
h:150
i:151
j:152
k:153
l:154
m:155
n:156
o:157
p:158
q:159
r:160
s:161
t:162
u:163
v:164
w:165
x:166
y:167
z:168
一:1651
丁:1652
七:1653
万:1654
丈:1655
三:1656
上:1657
下:1658
不:1659
与:1660
丐:1661
丑:1662
专:1663
且:1664
丕:1665
世:1666
丘:1667
丙:1668
业:1669
丛:1670
东:1671
丝:1672
丞:1673
丟:1674
両:1675
丢:1676
两:1677
严:1678
並:1679
丧:1680
个:1681
丫:1682
中:1683
丰:1684
串:1685
临:1686
丶:1687
丸:1688
丹:1689
为:1690
主:1691
丼:1692
丽:1693
举:1694
乂:1695
乃:1696
久:1697
么:1698
义:1699
之:1700
乌:1701
乍:1702
乎:1703
乏:1704
乐:1705
乒:1706
乓:1707
乔:1708
乖:1709
乗:1710
乘:1711
乙:1712
乜:1713
九:1714
乞:1715
也:1716
习:1717
乡:1718
书:1719
乩:1720
乭:1721
买:1722
乱:1723
乳:1724
乾:1725
亀:1726
亂:1727
了:1728
予:1729
争:1730
事:1731
二:1732
于:1733
亏:1734
云:1735
互:1736
五:1737
井:1738
亘:1739
亙:1740
亚:1741
些:1742
亜:1743
亞:1744
亟:1745
亡:1746
亢:1747
交:1748
亥:1749
亦:1750
产:1751
亨:1752
亩:1753
享:1754
京:1755
亭:1756
亮:1757
亰:1758
亲:1759
亳:1760
亵:1761
亶:1762
人:1763
亻:1764
亿:1765
什:1766
仁:1767
仃:1768
仄:1769
仅:1770
仆:1771
仇:1772
今:1773
介:1774
仍:1775
从:1776
仏:1777
仑:1778
仓:1779
仔:1780
仕:1781
他:1782
仗:1783
付:1784
仙:1785
仝:1786
仞:1787
仟:1788
仡:1789
代:1790
令:1791
以:1792
仪:1793
们:1794
仮:1795
仰:1796
仲:1797
仵:1798
件:1799
价:1800
任:1801
份:1802
仿:1803
企:1804
伉:1805
伊:1806
伋:1807
伍:1808
伎:1809
伏:1810
伐:1811
休:1812
伕:1813
众:1814
优:1815
伙:1816
会:1817
伝:1818
伞:1819
伟:1820
传:1821
伤:1822
伦:1823
伪:1824
伫:1825
伯:1826
估:1827
伴:1828
伶:1829
伷:1830
伸:1831
伺:1832
似:1833
伽:1834
佃:1835
但:1836
佇:1837
佈:1838
佉:1839
位:1840
低:1841
住:1842
佐:1843
佑:1844
体:1845
佔:1846
何:1847
佗:1848
佘:1849
余:1850
佚:1851
佛:1852
作:1853
佞:1854
佟:1855
你:1856
佢:1857
佣:1858
佤:1859
佥:1860
佩:1861
佬:1862
佯:1863
佰:1864
佳:1865
併:1866
佶:1867
佺:1868
佻:1869
佼:1870
佾:1871
使:1872
侂:1873
侃:1874
侄:1875
來:1876
侈:1877
例:1878
侍:1879
侏:1880
侑:1881
侖:1882
侗:1883
侘:1884
供:1885
依:1886
侠:1887
価:1888
侣:1889
侥:1890
侦:1891
侧:1892
侨:1893
侪:1894
侬:1895
侭:1896
侮:1897
侯:1898
侵:1899
侶:1900
侷:1901
便:1902
俁:1903
係:1904
促:1905
俄:1906
俅:1907
俊:1908
俎:1909
俏:1910
俐:1911
俑:1912
俗:1913
俘:1914
俚:1915
保:1916
俞:1917
俟:1918
俠:1919
信:1920
俣:1921
俥:1922
俦:1923
俨:1924
俩:1925
俪:1926
俬:1927
俭:1928
修:1929
俯:1930
俱:1931
俳:1932
俵:1933
俶:1934
俸:1935
俺:1936
俾:1937
倂:1938
倆:1939
倉:1940
個:1941
倍:1942
們:1943
倒:1944
倓:1945
倔:1946
倖:1947
倘:1948
候:1949
倚:1950
倜:1951
借:1952
倡:1953
倣:1954
値:1955
倦:1956
倧:1957
倩:1958
倪:1959
倫:1960
倬:1961
倭:1962
倮:1963
倶:1964
倹:1965
债:1966
倻:1967
值:1968
倾:1969
偁:1970
偃:1971
假:1972
偈:1973
偉:1974
偏:1975
偕:1976
做:1977
停:1978
健:1979
偰:1980
偲:1981
側:1982
偵:1983
偶:1984
偷:1985
偽:1986
偿:1987
傀:1988
傅:1989
傈:1990
傉:1991
傍:1992
傑:1993
傕:1994
傘:1995
備:1996
傚:1997
傢:1998
傣:1999
储:2000
催:2001
傭:2002
傲:2003
傳:2004
債:2005
傷:2006
傻:2007
傾:2008
僅:2009
僉:2010
僊:2011
働:2012
像:2013
僑:2014
僕:2015
僖:2016
僚:2017
僞:2018
僥:2019
僧:2020
僭:2021
僮:2022
僱:2023
僳:2024
僵:2025
價:2026
僻:2027
儀:2028
儁:2029
儂:2030
億:2031
儆:2032
儉:2033
儋:2034
儒:2035
儔:2036
儕:2037
儘:2038
儚:2039
償:2040
儡:2041
優:2042
儲:2043
儷:2044
儸:2045
儺:2046
儼:2047
儿:2048
兀:2049
允:2050
元:2051
兄:2052
充:2053
兆:2054
兇:2055
先:2056
光:2057
克:2058
兌:2059
免:2060
兎:2061
児:2062
兑:2063
兒:2064
兔:2065
兖:2066
兗:2067
党:2068
兜:2069
兢:2070
入:2071
內:2072
全:2073
兩:2074
兪:2075
八:2076
公:2077
六:2078
兮:2079
兰:2080
共:2081
关:2082
兴:2083
兵:2084
其:2085
具:2086
典:2087
兹:2088
养:2089
兼:2090
兽:2091
冀:2092
内:2093
円:2094
冇:2095
冈:2096
冉:2097
冊:2098
册:2099
再:2100
冏:2101
冑:2102
冒:2103
冕:2104
冗:2105
写:2106
军:2107
农:2108
冠:2109
冢:2110
冤:2111
冥:2112
冨:2113
冪:2114
冬:2115
冯:2116
冰:2117
冲:2118
决:2119
冴:2120
况:2121
冶:2122
冷:2123
冻:2124
冼:2125
冽:2126
净:2127
凄:2128
准:2129
凈:2130
凉:2131
凊:2132
凋:2133
凌:2134
凍:2135
减:2136
凑:2137
凖:2138
凛:2139
凜:2140
凝:2141
几:2142
凡:2143
凤:2144
処:2145
凧:2146
凪:2147
凫:2148
凭:2149
凯:2150
凰:2151
凱:2152
凳:2153
凶:2154
凸:2155
凹:2156
出:2157
击:2158
凼:2159
函:2160
凿:2161
刀:2162
刁:2163
刃:2164
分:2165
切:2166
刈:2167
刊:2168
刍:2169
刎:2170
刑:2171
划:2172
列:2173
刘:2174
则:2175
刚:2176
创:2177
初:2178
删:2179
判:2180
別:2181
刨:2182
利:2183
刪:2184
别:2185
刮:2186
到:2187
刳:2188
制:2189
刷:2190
券:2191
刹:2192
刺:2193
刻:2194
刽:2195
剁:2196
剂:2197
剃:2198
則:2199
削:2200
剋:2201
剌:2202
前:2203
剎:2204
剑:2205
剔:2206
剖:2207
剛:2208
剝:2209
剡:2210
剣:2211
剤:2212
剥:2213
剧:2214
剩:2215
剪:2216
副:2217
剰:2218
剱:2219
割:2220
創:2221
剷:2222
剽:2223
剿:2224
劃:2225
劇:2226
劈:2227
劉:2228
劊:2229
劍:2230
劑:2231
劔:2232
力:2233
劝:2234
办:2235
功:2236
加:2237
务:2238
劢:2239
劣:2240
动:2241
助:2242
努:2243
劫:2244
劭:2245
励:2246
劲:2247
劳:2248
労:2249
劵:2250
効:2251
劻:2252
劾:2253
势:2254
勁:2255
勃:2256
勅:2257
勇:2258
勉:2259
勋:2260
勐:2261
勒:2262
勔:2263
動:2264
勖:2265
勗:2266
勘:2267
務:2268
勛:2269
勝:2270
勞:2271
募:2272
勢:2273
勣:2274
勤:2275
勧:2276
勰:2277
勱:2278
勲:2279
勳:2280
勵:2281
勸:2282
勺:2283
勻:2284
勾:2285
勿:2286
匀:2287
匁:2288
匂:2289
包:2290
匆:2291
匈:2292
匍:2293
匏:2294
匐:2295
匕:2296
化:2297
北:2298
匙:2299
匝:2300
匠:2301
匡:2302
匣:2303
匪:2304
匮:2305
匯:2306
匱:2307
匹:2308
区:2309
医:2310
匾:2311
匿:2312
區:2313
十:2314
千:2315
卅:2316
升:2317
午:2318
卉:2319
半:2320
卍:2321
华:2322
协:2323
卐:2324
卑:2325
卒:2326
卓:2327
協:2328
单:2329
卖:2330
南:2331
単:2332
博:2333
卜:2334
卞:2335
卟:2336
占:2337
卡:2338
卢:2339
卤:2340
卦:2341
卧:2342
卫:2343
卬:2344
卯:2345
印:2346
危:2347
即:2348
却:2349
卵:2350
卷:2351
卸:2352
卹:2353
卻:2354
卽:2355
卿:2356
厂:2357
厄:2358
厅:2359
历:2360
厉:2361
压:2362
厌:2363
厓:2364
厔:2365
厕:2366
厘:2367
厚:2368
厝:2369
原:2370
厢:2371
厥:2372
厦:2373
厨:2374
厩:2375
厭:2376
厮:2377
厲:2378
厳:2379
去:2380
县:2381
叁:2382
参:2383
參:2384
叄:2385
又:2386
叉:2387
及:2388
友:2389
双:2390
反:2391
収:2392
发:2393
叔:2394
取:2395
受:2396
变:2397
叙:2398
叛:2399
叟:2400
叠:2401
叡:2402
叢:2403
口:2404
古:2405
句:2406
另:2407
叨:2408
叩:2409
只:2410
叫:2411
召:2412
叭:2413
叮:2414
可:2415
台:2416
叱:2417
史:2418
右:2419
叶:2420
号:2421
司:2422
叹:2423
叻:2424
叼:2425
吁:2426
吃:2427
各:2428
合:2429
吉:2430
吊:2431
吋:2432
同:2433
名:2434
后:2435
吏:2436
吐:2437
向:2438
吒:2439
吓:2440
吕:2441
吗:2442
君:2443
吝:2444
吞:2445
吟:2446
吠:2447
吡:2448
否:2449
吧:2450
吨:2451
吩:2452
含:2453
听:2454
吮:2455
启:2456
吱:2457
吲:2458
吳:2459
吴:2460
吵:2461
吶:2462
吸:2463
吹:2464
吻:2465
吼:2466
吽:2467
吾:2468
呀:2469
呂:2470
呃:2471
呆:2472
呈:2473
呉:2474
告:2475
呋:2476
呎:2477
呐:2478
呑:2479
呕:2480
呗:2481
员:2482
呛:2483
呜:2484
呟:2485
呢:2486
呤:2487
呦:2488
周:2489
呪:2490
呱:2491
味:2492
呵:2493
呷:2494
呻:2495
呼:2496
命:2497
咀:2498
咁:2499
咄:2500
咆:2501
咋:2502
和:2503
咎:2504
咏:2505
咐:2506
咒:2507
咔:2508
咕:2509
咖:2510
咗:2511
咙:2512
咚:2513
咤:2514
咥:2515
咧:2516
咨:2517
咩:2518
咪:2519
咫:2520
咬:2521
咭:2522
咯:2523
咱:2524
咲:2525
咳:2526
咸:2527
咽:2528
咿:2529
哀:2530
品:2531
哂:2532
哄:2533
哆:2534
哇:2535
哈:2536
哉:2537
哋:2538
哌:2539
响:2540
哎:2541
哏:2542
哑:2543
哒:2544
哔:2545
哗:2546
哙:2547
哚:2548
哟:2549
員:2550
哥:2551
哦:2552
哨:2553
哩:2554
哪:2555
哭:2556
哮:2557
哲:2558
哺:2559
哼:2560
哽:2561
唁:2562
唄:2563
唆:2564
唇:2565
唎:2566
唐:2567
唑:2568
唔:2569
唖:2570
唛:2571
唢:2572
唤:2573
唧:2574
唬:2575
唭:2576
售:2577
唯:2578
唱:2579
唵:2580
唷:2581
唸:2582
唾:2583
啃:2584
啄:2585
商:2586
啉:2587
啊:2588
問:2589
啓:2590
啖:2591
啜:2592
啞:2593
啟:2594
啡:2595
啤:2596
啥:2597
啦:2598
啪:2599
啬:2600
啮:2601
啰:2602
啲:2603
啶:2604
啸:2605
啼:2606
啾:2607
喀:2608
喂:2609
喃:2610
善:2611
喆:2612
喇:2613
喉:2614
喊:2615
喋:2616
喔:2617
喘:2618
喙:2619
喚:2620
喜:2621
喝:2622
喧:2623
喩:2624
喪:2625
喫:2626
喬:2627
單:2628
喰:2629
喱:2630
喲:2631
喵:2632
営:2633
喷:2634
喹:2635
喺:2636
喻:2637
嗅:2638
嗆:2639
嗇:2640
嗎:2641
嗓:2642
嗔:2643
嗚:2644
嗜:2645
嗝:2646
嗟:2647
嗡:2648
嗣:2649
嗤:2650
嗨:2651
嗩:2652
嗪:2653
嗯:2654
嗲:2655
嗶:2656
嗽:2657
嘅:2658
嘆:2659
嘈:2660
嘉:2661
嘌:2662
嘎:2663
嘏:2664
嘔:2665
嘗:2666
嘘:2667
嘛:2668
嘜:2669
嘟:2670
嘢:2671
嘧:2672
嘩:2673
嘯:2674
嘱:2675
嘲:2676
嘴:2677
嘶:2678
嘹:2679
嘻:2680
嘿:2681
噁:2682
噂:2683
噌:2684
噏:2685
噓:2686
噗:2687
噛:2688
噜:2689
噠:2690
噢:2691
噤:2692
器:2693
噩:2694
噪:2695
噫:2696
噬:2697
噱:2698
噲:2699
噴:2700
噶:2701
噸:2702
噹:2703
噺:2704
噻:2705
嚆:2706
嚇:2707
嚈:2708
嚎:2709
嚏:2710
嚐:2711
嚕:2712
嚙:2713
嚟:2714
嚢:2715
嚣:2716
嚥:2717
嚨:2718
嚮:2719
嚴:2720
嚷:2721
嚼:2722
囁:2723
囂:2724
囃:2725
囉:2726
囊:2727
囍:2728
囑:2729
囓:2730
囗:2731
囚:2732
四:2733
囝:2734
回:2735
因:2736
囡:2737
团:2738
団:2739
囤:2740
囧:2741
囪:2742
园:2743
囮:2744
困:2745
囱:2746
囲:2747
図:2748
围:2749
固:2750
国:2751
图:2752
囿:2753
圀:2754
圃:2755
圆:2756
圈:2757
圉:2758
國:2759
圍:2760
圏:2761
園:2762
圓:2763
圖:2764
團:2765
圜:2766
土:2767
圣:2768
圧:2769
在:2770
圩:2771
圪:2772
圭:2773
圮:2774
圯:2775
地:2776
圳:2777
圹:2778
场:2779
圻:2780
圾:2781
址:2782
坂:2783
均:2784
坊:2785
坌:2786
坍:2787
坎:2788
坏:2789
坐:2790
坑:2791
块:2792
坚:2793
坛:2794
坜:2795
坝:2796
坞:2797
坟:2798
坠:2799
坡:2800
坤:2801
坦:2802
坨:2803
坩:2804
坪:2805
坬:2806
坭:2807
坯:2808
坳:2809
坵:2810
坷:2811
坻:2812
垂:2813
垃:2814
垄:2815
垅:2816
垈:2817
型:2818
垌:2819
垒:2820
垓:2821
垕:2822
垚:2823
垛:2824
垟:2825
垠:2826
垡:2827
垢:2828
垣:2829
垦:2830
垩:2831
垫:2832
垭:2833
垮:2834
垴:2835
垵:2836
垸:2837
埂:2838
埃:2839
埈:2840
埋:2841
城:2842
埏:2843
埒:2844
埔:2845
埕:2846
埗:2847
埙:2848
埜:2849
埝:2850
域:2851
埠:2852
埡:2853
埤:2854
埭:2855
埴:2856
埵:2857
執:2858
埸:2859
培:2860
基:2861
埼:2862
堀:2863
堂:2864
堃:2865
堅:2866
堆:2867
堇:2868
堉:2869
堊:2870
堑:2871
堕:2872
堝:2873
堞:2874
堡:2875
堤:2876
堪:2877
堯:2878
堰:2879
報:2880
場:2881
堵:2882
堺:2883
塀:2884
塁:2885
塊:2886
塋:2887
塌:2888
塑:2889
塔:2890
塗:2891
塘:2892
塙:2893
塚:2894
塞:2895
塡:2896
塢:2897
塩:2898
填:2899
塬:2900
塭:2901
塱:2902
塵:2903
塹:2904
塽:2905
塾:2906
墀:2907
境:2908
墅:2909
墉:2910
墊:2911
墓:2912
墕:2913
増:2914
墘:2915
墙:2916
墜:2917
增:2918
墟:2919
墨:2920
墩:2921
墬:2922
墮:2923
墳:2924
墺:2925
墻:2926
墾:2927
壁:2928
壅:2929
壆:2930
壇:2931
壊:2932
壌:2933
壑:2934
壓:2935
壕:2936
壘:2937
壙:2938
壞:2939
壟:2940
壠:2941
壢:2942
壤:2943
壩:2944
士:2945
壬:2946
壮:2947
壯:2948
声:2949
壱:2950
売:2951
壳:2952
壶:2953
壷:2954
壹:2955
壺:2956
壽:2957
处:2958
备:2959
変:2960
复:2961
夏:2962
夔:2963
夕:2964
外:2965
夙:2966
多:2967
夜:2968
够:2969
夠:2970
夢:2971
夤:2972
夥:2973
大:2974
天:2975
太:2976
夫:2977
夭:2978
央:2979
夯:2980
失:2981
头:2982
夷:2983
夸:2984
夹:2985
夺:2986
夼:2987
夾:2988
奂:2989
奄:2990
奇:2991
奈:2992
奉:2993
奋:2994
奎:2995
奏:2996
奐:2997
契:2998
奔:2999
奕:3000
奖:3001
套:3002
奘:3003
奚:3004
奠:3005
奢:3006
奥:3007
奧:3008
奨:3009
奪:3010
奬:3011
奭:3012
奮:3013
女:3014
奴:3015
奶:3016
奸:3017
她:3018
好:3019
如:3020
妃:3021
妄:3022
妆:3023
妇:3024
妈:3025
妊:3026
妍:3027
妒:3028
妓:3029
妖:3030
妙:3031
妝:3032
妞:3033
妣:3034
妤:3035
妥:3036
妨:3037
妫:3038
妬:3039
妮:3040
妲:3041
妳:3042
妹:3043
妻:3044
妾:3045
姆:3046
姉:3047
姊:3048
始:3049
姍:3050
姐:3051
姑:3052
姒:3053
姓:3054
委:3055
姗:3056
姚:3057
姜:3058
姝:3059
姣:3060
姥:3061
姦:3062
姨:3063
姪:3064
姫:3065
姬:3066
姵:3067
姶:3068
姻:3069
姿:3070
威:3071
娃:3072
娄:3073
娅:3074
娆:3075
娇:3076
娉:3077
娑:3078
娓:3079
娘:3080
娛:3081
娜:3082
娟:3083
娠:3084
娣:3085
娥:3086
娩:3087
娯:3088
娱:3089
娲:3090
娴:3091
娶:3092
娼:3093
婁:3094
婆:3095
婉:3096
婕:3097
婚:3098
婢:3099
婦:3100
婧:3101
婪:3102
婬:3103
婭:3104
婴:3105
婵:3106
婶:3107
婷:3108
婺:3109
婿:3110
媒:3111
媚:3112
媛:3113
媞:3114
媧:3115
媯:3116
媲:3117
媳:3118
媽:3119
媾:3120
嫁:3121
嫂:3122
嫄:3123
嫉:3124
嫌:3125
嫔:3126
嫖:3127
嫗:3128
嫚:3129
嫡:3130
嫣:3131
嫦:3132
嫩:3133
嫻:3134
嬅:3135
嬈:3136
嬉:3137
嬋:3138
嬌:3139
嬖:3140
嬗:3141
嬛:3142
嬢:3143
嬤:3144
嬪:3145
嬬:3146
嬰:3147
嬲:3148
嬴:3149
嬷:3150
嬸:3151
嬿:3152
孀:3153
孃:3154
子:3155
孑:3156
孔:3157
孕:3158
孖:3159
字:3160
存:3161
孙:3162
孚:3163
孛:3164
孜:3165
孝:3166
孟:3167
孢:3168
季:3169
孤:3170
学:3171
孩:3172
孪:3173
孫:3174
孰:3175
孱:3176
孳:3177
孵:3178
學:3179
孺:3180
孽:3181
孿:3182
宀:3183
宁:3184
它:3185
宅:3186
宇:3187
守:3188
安:3189
宋:3190
完:3191
宍:3192
宏:3193
宓:3194
宕:3195
宗:3196
官:3197
宙:3198
定:3199
宛:3200
宜:3201
宝:3202
实:3203
実:3204
宠:3205
审:3206
客:3207
宣:3208
室:3209
宥:3210
宦:3211
宪:3212
宫:3213
宮:3214
宰:3215
害:3216
宴:3217
宵:3218
家:3219
宸:3220
容:3221
宽:3222
宾:3223
宿:3224
寂:3225
寄:3226
寅:3227
密:3228
寇:3229
富:3230
寐:3231
寒:3232
寓:3233
寔:3234
寘:3235
寛:3236
寝:3237
寞:3238
察:3239
寡:3240
寢:3241
寥:3242
實:3243
寧:3244
寨:3245
審:3246
寫:3247
寬:3248
寮:3249
寯:3250
寰:3251
寳:3252
寵:3253
寶:3254
寸:3255
对:3256
寺:3257
寻:3258
导:3259
対:3260
寿:3261
封:3262
専:3263
射:3264
将:3265
將:3266
專:3267
尉:3268
尊:3269
尋:3270
對:3271
導:3272
小:3273
少:3274
尔:3275
尕:3276
尖:3277
尘:3278
尙:3279
尚:3280
尝:3281
尤:3282
尧:3283
尪:3284
尬:3285
尭:3286
就:3287
尴:3288
尷:3289
尸:3290
尹:3291
尺:3292
尻:3293
尼:3294
尽:3295
尾:3296
尿:3297
局:3298
屁:3299
层:3300
居:3301
屆:3302
屈:3303
届:3304
屋:3305
屌:3306
屍:3307
屎:3308
屏:3309
屐:3310
屑:3311
屓:3312
展:3313
属:3314
屠:3315
屡:3316
屢:3317
層:3318
履:3319
屬:3320
屯:3321
山:3322
屹:3323
屿:3324
岀:3325
岁:3326
岂:3327
岌:3328
岐:3329
岑:3330
岔:3331
岖:3332
岗:3333
岘:3334
岙:3335
岚:3336
岛:3337
岡:3338
岢:3339
岩:3340
岫:3341
岬:3342
岭:3343
岱:3344
岳:3345
岷:3346
岸:3347
峁:3348
峄:3349
峇:3350
峋:3351
峒:3352
峙:3353
峠:3354
峡:3355
峤:3356
峥:3357
峦:3358
峨:3359
峩:3360
峪:3361
峭:3362
峯:3363
峰:3364
峴:3365
島:3366
峻:3367
峽:3368
崁:3369
崂:3370
崆:3371
崇:3372
崋:3373
崍:3374
崎:3375
崐:3376
崑:3377
崔:3378
崖:3379
崗:3380
崙:3381
崚:3382
崛:3383
崞:3384
崢:3385
崤:3386
崧:3387
崩:3388
崭:3389
崮:3390
崱:3391
崴:3392
崽:3393
嵇:3394
嵊:3395
嵋:3396
嵌:3397
嵐:3398
嵘:3399
嵙:3400
嵜:3401
嵩:3402
嵬:3403
嵯:3404
嵴:3405
嶂:3406
嶄:3407
嶇:3408
嶋:3409
嶌:3410
嶗:3411
嶙:3412
嶝:3413
嶠:3414
嶧:3415
嶴:3416
嶷:3417
嶸:3418
嶺:3419
嶼:3420
嶽:3421
巂:3422
巅:3423
巌:3424
巍:3425
巒:3426
巔:3427
巖:3428
川:3429
州:3430
巡:3431
巢:3432
巣:3433
工:3434
左:3435
巧:3436
巨:3437
巩:3438
巫:3439
差:3440
己:3441
已:3442
巳:3443
巴:3444
巷:3445
巻:3446
巽:3447
巾:3448
巿:3449
币:3450
市:3451
布:3452
帅:3453
帆:3454
师:3455
希:3456
帐:3457
帑:3458
帕:3459
帖:3460
帘:3461
帙:3462
帚:3463
帛:3464
帜:3465
帝:3466
帥:3467
带:3468
帧:3469
師:3470
席:3471
帮:3472
帯:3473
帰:3474
帳:3475
帶:3476
帷:3477
常:3478
帼:3479
帽:3480
幀:3481
幂:3482
幄:3483
幅:3484
幇:3485
幌:3486
幔:3487
幕:3488
幗:3489
幟:3490
幡:3491
幢:3492
幣:3493
幪:3494
幫:3495
干:3496
平:3497
年:3498
并:3499
幷:3500
幸:3501
幹:3502
幺:3503
幻:3504
幼:3505
幽:3506
幾:3507
广:3508
庁:3509
広:3510
庄:3511
庆:3512
庇:3513
床:3514
序:3515
庐:3516
庑:3517
库:3518
应:3519
底:3520
庖:3521
店:3522
庙:3523
庚:3524
府:3525
庞:3526
废:3527
庠:3528
庥:3529
度:3530
座:3531
庫:3532
庭:3533
庵:3534
庶:3535
康:3536
庸:3537
庹:3538
庾:3539
廁:3540
廂:3541
廃:3542
廄:3543
廆:3544
廈:3545
廉:3546
廊:3547
廍:3548
廓:3549
廖:3550
廙:3551
廚:3552
廝:3553
廞:3554
廟:3555
廠:3556
廡:3557
廢:3558
廣:3559
廨:3560
廩:3561
廪:3562
廬:3563
廳:3564
延:3565
廷:3566
廸:3567
建:3568
廻:3569
廼:3570
廿:3571
开:3572
弁:3573
异:3574
弃:3575
弄:3576
弇:3577
弈:3578
弉:3579
弊:3580
弋:3581
弌:3582
式:3583
弐:3584
弑:3585
弒:3586
弓:3587
弔:3588
引:3589
弖:3590
弗:3591
弘:3592
弛:3593
弟:3594
张:3595
弢:3596
弥:3597
弦:3598
弧:3599
弩:3600
弭:3601
弯:3602
弱:3603
張:3604
強:3605
弹:3606
强:3607
弼:3608
弾:3609
彀:3610
彅:3611
彈:3612
彊:3613
彌:3614
彎:3615
归:3616
当:3617
录:3618
彗:3619
彘:3620
彙:3621
彝:3622
彡:3623
形:3624
彤:3625
彥:3626
彦:3627
彧:3628
彩:3629
彪:3630
彫:3631
彬:3632
彭:3633
彰:3634
影:3635
彳:3636
彷:3637
役:3638
彻:3639
彼:3640
彿:3641
往:3642
征:3643
徂:3644
径:3645
待:3646
徇:3647
很:3648
徊:3649
律:3650
後:3651
徐:3652
徑:3653
徒:3654
従:3655
徕:3656
得:3657
徘:3658
徙:3659
從:3660
徠:3661
御:3662
徨:3663
復:3664
循:3665
徬:3666
徭:3667
微:3668
徳:3669
徴:3670
徵:3671
德:3672
徹:3673
徽:3674
心:3675
忄:3676
必:3677
忆:3678
忉:3679
忌:3680
忍:3681
忏:3682
忒:3683
志:3684
忘:3685
忙:3686
応:3687
忞:3688
忠:3689
忡:3690
忤:3691
忧:3692
快:3693
忱:3694
念:3695
忻:3696
忽:3697
忿:3698
怀:3699
态:3700
怂:3701
怎:3702
怒:3703
怕:3704
怖:3705
怙:3706
怛:3707
怜:3708
思:3709
怠:3710
怡:3711
急:3712
怦:3713
性:3714
怨:3715
怪:3716
怯:3717
总:3718
怿:3719
恂:3720
恃:3721
恆:3722
恋:3723
恍:3724
恐:3725
恒:3726
恕:3727
恙:3728
恚:3729
恢:3730
恣:3731
恤:3732
恥:3733
恨:3734
恩:3735
恪:3736
恫:3737
恬:3738
恭:3739
息:3740
恰:3741
恳:3742
恵:3743
恶:3744
恸:3745
恺:3746
恼:3747
恽:3748
恿:3749
悄:3750
悅:3751
悉:3752
悌:3753
悍:3754
悔:3755
悖:3756
悚:3757
悛:3758
悝:3759
悟:3760
悠:3761
患:3762
悦:3763
悧:3764
您:3765
悩:3766
悪:3767
悫:3768
悬:3769
悯:3770
悰:3771
悲:3772
悳:3773
悴:3774
悶:3775
悸:3776
悼:3777
悽:3778
情:3779
惇:3780
惊:3781
惋:3782
惑:3783
惕:3784
惘:3785
惚:3786
惛:3787
惜:3788
惟:3789
惠:3790
惡:3791
惣:3792
惧:3793
惨:3794
惩:3795
惫:3796
惭:3797
惮:3798
惯:3799
惰:3800
惱:3801
惲:3802
想:3803
惶:3804
惹:3805
惺:3806
愁:3807
愃:3808
愆:3809
愈:3810
愉:3811
愍:3812
愎:3813
意:3814
愔:3815
愕:3816
愚:3817
愛:3818
感:3819
愤:3820
愧:3821
愨:3822
愫:3823
愴:3824
愷:3825
愼:3826
愾:3827
愿:3828
慄:3829
慇:3830
慈:3831
態:3832
慌:3833
慎:3834
慑:3835
慕:3836
慘:3837
慚:3838
慜:3839
慟:3840
慢:3841
慣:3842
慤:3843
慧:3844
慨:3845
慫:3846
慮:3847
慰:3848
慳:3849
慵:3850
慶:3851
慷:3852
慾:3853
憂:3854
憊:3855
憍:3856
憎:3857
憐:3858
憑:3859
憔:3860
憙:3861
憚:3862
憤:3863
憧:3864
憨:3865
憩:3866
憫:3867
憬:3868
憲:3869
憶:3870
憺:3871
憾:3872
懂:3873
懃:3874
懇:3875
懈:3876
應:3877
懊:3878
懋:3879
懌:3880
懐:3881
懒:3882
懦:3883
懲:3884
懵:3885
懶:3886
懷:3887
懸:3888
懺:3889
懼:3890
懾:3891
懿:3892
戀:3893
戈:3894
戊:3895
戌:3896
戍:3897
戎:3898
戏:3899
成:3900
我:3901
戒:3902
戔:3903
戕:3904
或:3905
战:3906
戚:3907
戛:3908
戟:3909
戡:3910
戢:3911
戦:3912
戩:3913
截:3914
戮:3915
戯:3916
戰:3917
戱:3918
戲:3919
戳:3920
戴:3921
戶:3922
户:3923
戸:3924
戻:3925
戾:3926
房:3927
所:3928
扁:3929
扆:3930
扇:3931
扈:3932
扉:3933
手:3934
扌:3935
才:3936
扎:3937
扑:3938
扒:3939
打:3940
扔:3941
払:3942
托:3943
扛:3944
扣:3945
扦:3946
执:3947
扩:3948
扫:3949
扬:3950
扭:3951
扮:3952
扯:3953
扰:3954
扱:3955
扳:3956
扶:3957
批:3958
扼:3959
找:3960
承:3961
技:3962
抄:3963
抉:3964
把:3965
抑:3966
抒:3967
抓:3968
投:3969
抖:3970
抗:3971
折:3972
抚:3973
抛:3974
抜:3975
択:3976
抟:3977
抡:3978
抢:3979
护:3980
报:3981
抨:3982
披:3983
抬:3984
抱:3985
抵:3986
抹:3987
押:3988
抽:3989
拂:3990
担:3991
拆:3992
拇:3993
拈:3994
拉:3995
拋:3996
拌:3997
拍:3998
拏:3999
拐:4000
拒:4001
拓:4002
拔:4003
拖:4004
拗:4005
拘:4006
拙:4007
拚:4008
招:4009
拜:4010
拝:4011
拟:4012
拠:4013
拡:4014
拢:4015
拣:4016
拥:4017
拦:4018
拨:4019
择:4020
括:4021
拭:4022
拮:4023
拯:4024
拱:4025
拳:4026
拴:4027
拵:4028
拶:4029
拷:4030
拼:4031
拽:4032
拾:4033
拿:4034
持:4035
挂:4036
指:4037
挈:4038
按:4039
挑:4040
挖:4041
挙:4042
挚:4043
挛:4044
挝:4045
挞:4046
挟:4047
挠:4048
挡:4049
挣:4050
挤:4051
挥:4052
挨:4053
挪:4054
挫:4055
振:4056
挹:4057
挺:4058
挽:4059
挾:4060
挿:4061
捅:4062
捆:4063
捉:4064
捌:4065
捍:4066
捎:4067
捏:4068
捐:4069
捒:4070
捕:4071
捗:4072
捜:4073
捞:4074
损:4075
捡:4076
换:4077
捣:4078
捧:4079
捨:4080
捩:4081
据:4082
捱:4083
捲:4084
捶:4085
捷:4086
捺:4087
捻:4088
掀:4089
掃:4090
授:4091
掉:4092
掌:4093
掏:4094
掐:4095
排:4096
掖:4097
掘:4098
掙:4099
掛:4100
掟:4101
掠:4102
採:4103
探:4104
掣:4105
接:4106
控:4107
推:4108
掩:4109
措:4110
掬:4111
掰:4112
掲:4113
掳:4114
掴:4115
掷:4116
掸:4117
掺:4118
掻:4119
掾:4120
揀:4121
揃:4122
揄:4123
揆:4124
揉:4125
揍:4126
描:4127
提:4128
插:4129
揖:4130
揚:4131
換:4132
握:4133
揣:4134
揪:4135
揭:4136
揮:4137
援:4138
揶:4139
揺:4140
揽:4141
揾:4142
搁:4143
搅:4144
損:4145
搏:4146
搐:4147
搓:4148
搔:4149
搖:4150
搗:4151
搜:4152
搞:4153
搦:4154
搪:4155
搬:4156
搭:4157
搵:4158
搶:4159
携:4160
搾:4161
摂:4162
摄:4163
摆:4164
摇:4165
摊:4166
摑:4167
摒:4168
摔:4169
摘:4170
摠:4171
摧:4172
摩:4173
摭:4174
摯:4175
摶:4176
摸:4177
摹:4178
摺:4179
摻:4180
撃:4181
撇:4182
撈:4183
撐:4184
撑:4185
撒:4186
撓:4187
撕:4188
撚:4189
撞:4190
撣:4191
撤:4192
撥:4193
撩:4194
撫:4195
撬:4196
播:4197
撮:4198
撰:4199
撲:4200
撷:4201
撹:4202
撻:4203
撼:4204
撿:4205
擁:4206
擂:4207
擄:4208
擅:4209
擇:4210
擊:4211
擋:4212
操:4213
擎:4214
擒:4215
擔:4216
擘:4217
據:4218
擠:4219
擢:4220
擦:4221
擧:4222
擬:4223
擱:4224
擲:4225
擴:4226
擷:4227
擺:4228
擾:4229
攀:4230
攏:4231
攒:4232
攔:4233
攘:4234
攜:4235
攝:4236
攢:4237
攣:4238
攤:4239
攪:4240
攫:4241
攬:4242
支:4243
收:4244
攷:4245
攸:4246
改:4247
攻:4248
放:4249
政:4250
故:4251
效:4252
敌:4253
敍:4254
敎:4255
敏:4256
救:4257
敕:4258
敖:4259
敗:4260
敘:4261
教:4262
敛:4263
敝:4264
敞:4265
敢:4266
散:4267
敦:4268
敬:4269
数:4270
敲:4271
整:4272
敵:4273
敷:4274
數:4275
斂:4276
斃:4277
文:4278
斉:4279
斋:4280
斌:4281
斎:4282
斐:4283
斑:4284
斗:4285
料:4286
斛:4287
斜:4288
斟:4289
斡:4290
斤:4291
斥:4292
斧:4293
斩:4294
斫:4295
斬:4296
断:4297
斯:4298
新:4299
斷:4300
方:4301
於:4302
施:4303
旁:4304
旃:4305
旅:4306
旋:4307
旌:4308
族:4309
旒:4310
旗:4311
旛:4312
无:4313
既:4314
旣:4315
日:4316
旦:4317
旧:4318
旨:4319
早:4320
旬:4321
旭:4322
旱:4323
时:4324
旷:4325
旸:4326
旺:4327
旻:4328
旼:4329
昀:4330
昂:4331
昆:4332
昇:4333
昉:4334
昊:4335
昌:4336
明:4337
昏:4338
昐:4339
易:4340
昔:4341
昕:4342
昙:4343
昝:4344
昞:4345
星:4346
映:4347
春:4348
昧:4349
昨:4350
昪:4351
昭:4352
是:4353
昰:4354
昱:4355
昴:4356
昵:4357
昶:4358
昺:4359
昼:4360
显:4361
晁:4362
時:4363
晃:4364
晄:4365
晉:4366
晋:4367
晏:4368
晒:4369
晓:4370
晔:4371
晕:4372
晖:4373
晗:4374
晙:4375
晚:4376
晝:4377
晞:4378
晟:4379
晤:4380
晦:4381
晧:4382
晨:4383
晩:4384
普:4385
景:4386
晰:4387
晳:4388
晴:4389
晶:4390
晷:4391
晸:4392
智:4393
晾:4394
暁:4395
暂:4396
暄:4397
暇:4398
暈:4399
暉:4400
暌:4401
暎:4402
暐:4403
暑:4404
暖:4405
暗:4406
暘:4407
暝:4408
暠:4409
暢:4410
暦:4411
暧:4412
暨:4413
暫:4414
暮:4415
暱:4416
暲:4417
暴:4418
暹:4419
暻:4420
暾:4421
曄:4422
曆:4423
曇:4424
曉:4425
曖:4426
曙:4427
曜:4428
曝:4429
曠:4430
曦:4431
曩:4432
曬:4433
曰:4434
曲:4435
曳:4436
更:4437
曷:4438
書:4439
曹:4440
曺:4441
曼:4442
曽:4443
曾:4444
替:4445
最:4446
會:4447
月:4448
有:4449
朋:4450
服:4451
朐:4452
朓:4453
朔:4454
朕:4455
朗:4456
望:4457
朝:4458
期:4459
朦:4460
朧:4461
木:4462
未:4463
末:4464
本:4465
札:4466
朮:4467
术:4468
朱:4469
朴:4470
朵:4471
朶:4472
机:4473
朽:4474
杀:4475
杂:4476
权:4477
杆:4478
杉:4479
杌:4480
李:4481
杏:4482
材:4483
村:4484
杓:4485
杖:4486
杙:4487
杜:4488
杞:4489
束:4490
杠:4491
条:4492
杢:4493
杣:4494
来:4495
杨:4496
杭:4497
杮:4498
杯:4499
杰:4500
東:4501
杲:4502
杳:4503
杵:4504
杷:4505
杼:4506
松:4507
板:4508
极:4509
构:4510
枇:4511
枉:4512
枋:4513
析:4514
枕:4515
林:4516
枚:4517
果:4518
枝:4519
枞:4520
枠:4521
枡:4522
枢:4523
枣:4524
枪:4525
枫:4526
枭:4527
枯:4528
枳:4529
架:4530
枷:4531
枸:4532
枹:4533
柁:4534
柃:4535
柄:4536
柊:4537
柏:4538
某:4539
柑:4540
柒:4541
染:4542
柔:4543
柘:4544
柚:4545
柜:4546
柝:4547
柞:4548
柠:4549
柢:4550
查:4551
柩:4552
柬:4553
柯:4554
柱:4555
柳:4556
柴:4557
柵:4558
査:4559
柽:4560
柾:4561
柿:4562
栂:4563
栃:4564
栄:4565
栅:4566
标:4567
栈:4568
栉:4569
栋:4570
栎:4571
栏:4572
树:4573
栒:4574
栓:4575
栖:4576
栗:4577
栞:4578
校:4579
栢:4580
栩:4581
株:4582
栱:4583
栲:4584
栴:4585
样:4586
核:4587
根:4588
栻:4589
格:4590
栽:4591
栾:4592
桀:4593
桁:4594
桂:4595
桃:4596
桅:4597
框:4598
案:4599
桉:4600
桌:4601
桎:4602
桐:4603
桑:4604
桓:4605
桔:4606
桜:4607
桝:4608
桟:4609
桡:4610
桢:4611
档:4612
桥:4613
桦:4614
桧:4615
桨:4616
桩:4617
桫:4618
桶:4619
桷:4620
桿:4621
梁:4622
梃:4623
梅:4624
梆:4625
梓:4626
梔:4627
梗:4628
條:4629
梟:4630
梠:4631
梢:4632
梦:4633
梧:4634
梨:4635
梭:4636
梯:4637
械:4638
梱:4639
梳:4640
梵:4641
梶:4642
检:4643
棂:4644
棄:4645
棉:4646
棋:4647
棍:4648
棒:4649
棕:4650
棗:4651
棘:4652
棚:4653
棟:4654
棠:4655
棣:4656
棧:4657
棨:4658
棫:4659
森:4660
棱:4661
棲:4662
棵:4663
棹:4664
棺:4665
棻:4666
椀:4667
椁:4668
椅:4669
椋:4670
植:4671
椎:4672
椏:4673
椒:4674
椙:4675
椚:4676
椛:4677
検:4678
椭:4679
椰:4680
椴:4681
椹:4682
椽:4683
椿:4684
楂:4685
楊:4686
楓:4687
楔:4688
楕:4689
楙:4690
楚:4691
楝:4692
楞:4693
楠:4694
楡:4695
楢:4696
楣:4697
楨:4698
楫:4699
業:4700
楮:4701
楯:4702
楳:4703
極:4704
楷:4705
楸:4706
楹:4707
楼:4708
楽:4709
概:4710
榄:4711
榆:4712
榈:4713
榉:4714
榊:4715
榎:4716
榑:4717
榔:4718
榕:4719
榖:4720
榘:4721
榛:4722
榜:4723
榧:4724
榨:4725
榫:4726
榭:4727
榮:4728
榴:4729
榷:4730
榻:4731
槁:4732
槃:4733
槇:4734
槊:4735
構:4736
槌:4737
槍:4738
槎:4739
槐:4740
槓:4741
様:4742
槙:4743
槛:4744
槟:4745
槤:4746
槨:4747
槪:4748
槭:4749
槲:4750
槳:4751
槺:4752
槻:4753
槽:4754
槿:4755
樁:4756
樂:4757
樅:4758
樊:4759
樋:4760
樑:4761
樓:4762
樗:4763
標:4764
樞:4765
樟:4766
模:4767
樣:4768
樨:4769
権:4770
横:4771
樫:4772
樱:4773
樵:4774
樸:4775
樹:4776
樺:4777
樽:4778
樾:4779
橄:4780
橇:4781
橈:4782
橋:4783
橐:4784
橘:4785
橙:4786
機:4787
橡:4788
橢:4789
橫:4790
橱:4791
橹:4792
橿:4793
檀:4794
檄:4795
檉:4796
檎:4797
檐:4798
檔:4799
檗:4800
檜:4801
檢:4802
檣:4803
檬:4804
檯:4805
檳:4806
檸:4807
檻:4808
櫂:4809
櫃:4810
櫓:4811
櫚:4812
櫛:4813
櫟:4814
櫥:4815
櫨:4816
櫸:4817
櫻:4818
欄:4819
欅:4820
欉:4821
權:4822
欒:4823
欖:4824
欞:4825
欠:4826
次:4827
欢:4828
欣:4829
欤:4830
欧:4831
欲:4832
欺:4833
欽:4834
款:4835
歆:4836
歇:4837
歉:4838
歌:4839
歎:4840
歐:4841
歓:4842
歙:4843
歟:4844
歡:4845
止:4846
正:4847
此:4848
步:4849
武:4850
歧:4851
歩:4852
歪:4853
歯:4854
歲:4855
歳:4856
歴:4857
歷:4858
歸:4859
歹:4860
死:4861
歼:4862
歿:4863
殁:4864
殃:4865
殆:4866
殇:4867
殉:4868
殊:4869
残:4870
殒:4871
殓:4872
殖:4873
殘:4874
殞:4875
殡:4876
殤:4877
殭:4878
殮:4879
殯:4880
殲:4881
殴:4882
段:4883
殷:4884
殺:4885
殻:4886
殼:4887
殿:4888
毀:4889
毁:4890
毂:4891
毅:4892
毆:4893
毋:4894
毌:4895
母:4896
毎:4897
每:4898
毒:4899
毓:4900
比:4901
毕:4902
毖:4903
毗:4904
毘:4905
毙:4906
毛:4907
毡:4908
毫:4909
毬:4910
毯:4911
毽:4912
氂:4913
氈:4914
氏:4915
氐:4916
民:4917
氓:4918
气:4919
氖:4920
気:4921
氘:4922
氙:4923
氚:4924
氛:4925
氟:4926
氡:4927
氢:4928
氣:4929
氦:4930
氧:4931
氨:4932
氩:4933
氪:4934
氫:4935
氬:4936
氮:4937
氯:4938
氰:4939
水:4940
氵:4941
氷:4942
永:4943
氹:4944
氾:4945
汀:4946
汁:4947
求:4948
汇:4949
汉:4950
汊:4951
汎:4952
汐:4953
汕:4954
汗:4955
汙:4956
汚:4957
汛:4958
汜:4959
汝:4960
汞:4961
江:4962
池:4963
污:4964
汤:4965
汧:4966
汨:4967
汪:4968
汭:4969
汰:4970
汲:4971
汴:4972
汶:4973
汹:4974
決:4975
汽:4976
汾:4977
沁:4978
沂:4979
沃:4980
沄:4981
沅:4982
沆:4983
沈:4984
沉:4985
沌:4986
沐:4987
沒:4988
沓:4989
沔:4990
沖:4991
沙:4992
沛:4993
沟:4994
没:4995
沢:4996
沣:4997
沥:4998
沦:4999
沧:5000
沪:5001
沫:5002
沭:5003
沮:5004
沱:5005
河:5006
沸:5007
油:5008
治:5009
沼:5010
沽:5011
沾:5012
沿:5013
況:5014
泄:5015
泉:5016
泊:5017
泌:5018
泓:5019
法:5020
泗:5021
泚:5022
泛:5023
泞:5024
泠:5025
泡:5026
波:5027
泣:5028
泥:5029
注:5030
泪:5031
泫:5032
泮:5033
泯:5034
泰:5035
泱:5036
泳:5037
泵:5038
泷:5039
泸:5040
泻:5041
泼:5042
泽:5043
泾:5044
洁:5045
洄:5046
洋:5047
洎:5048
洒:5049
洗:5050
洙:5051
洛:5052
洞:5053
津:5054
洧:5055
洩:5056
洪:5057
洮:5058
洱:5059
洲:5060
洵:5061
洶:5062
洸:5063
洹:5064
洺:5065
活:5066
洼:5067
洽:5068
派:5069
流:5070
浄:5071
浅:5072
浆:5073
浇:5074
浊:5075
测:5076
济:5077
浏:5078
浑:5079
浒:5080
浓:5081
浔:5082
浙:5083
浚:5084
浜:5085
浞:5086
浠:5087
浣:5088
浤:5089
浦:5090
浩:5091
浪:5092
浬:5093
浮:5094
浯:5095
浴:5096
海:5097
浸:5098
涂:5099
涅:5100
涇:5101
消:5102
涉:5103
涌:5104
涎:5105
涓:5106
涔:5107
涕:5108
涙:5109
涛:5110
涜:5111
涝:5112
涞:5113
涟:5114
涡:5115
涣:5116
涤:5117
润:5118
涧:5119
涨:5120
涩:5121
涪:5122
涮:5123
涯:5124
液:5125
涵:5126
涸:5127
涼:5128
涿:5129
淀:5130
淄:5131
淅:5132
淆:5133
淇:5134
淋:5135
淌:5136
淑:5137
淒:5138
淖:5139
淘:5140
淙:5141
淚:5142
淝:5143
淞:5144
淡:5145
淤:5146
淦:5147
淨:5148
淩:5149
淪:5150
淫:5151
淬:5152
淮:5153
淯:5154
深:5155
淳:5156
淵:5157
淶:5158
混:5159
淸:5160
淹:5161
淺:5162
添:5163
淼:5164
清:5165
渇:5166
済:5167
渉:5168
渊:5169
渋:5170
渍:5171
渎:5172
渐:5173
渓:5174
渔:5175
渕:5176
渗:5177
渙:5178
渚:5179
減:5180
渝:5181
渟:5182
渠:5183
渡:5184
渣:5185
渤:5186
渥:5187
渦:5188
温:5189
渫:5190
測:5191
渭:5192
港:5193
渲:5194
渴:5195
游:5196
渺:5197
渾:5198
湃:5199
湄:5200
湊:5201
湍:5202
湖:5203
湘:5204
湛:5205
湜:5206
湟:5207
湣:5208
湧:5209
湫:5210
湮:5211
湯:5212
湳:5213
湾:5214
湿:5215
満:5216
溃:5217
溅:5218
溆:5219
溉:5220
溏:5221
源:5222
準:5223
溜:5224
溝:5225
溟:5226
溢:5227
溥:5228
溧:5229
溪:5230
溫:5231
溯:5232
溱:5233
溲:5234
溴:5235
溶:5236
溺:5237
溼:5238
滁:5239
滂:5240
滄:5241
滅:5242
滇:5243
滉:5244
滋:5245
滌:5246
滎:5247
滏:5248
滑:5249
滓:5250
滔:5251
滕:5252
滘:5253
滙:5254
滚:5255
滝:5256
滞:5257
满:5258
滢:5259
滤:5260
滥:5261
滦:5262
滨:5263
滩:5264
滬:5265
滯:5266
滲:5267
滴:5268
滷:5269
滸:5270
滹:5271
滾:5272
滿:5273
漁:5274
漂:5275
漆:5276
漉:5277
漏:5278
漑:5279
漓:5280
演:5281
漕:5282
漠:5283
漢:5284
漣:5285
漩:5286
漪:5287
漫:5288
漬:5289
漯:5290
漱:5291
漲:5292
漳:5293
漵:5294
漸:5295
漾:5296
漿:5297
潁:5298
潇:5299
潍:5300
潑:5301
潔:5302
潘:5303
潛:5304
潜:5305
潞:5306
潟:5307
潢:5308
潤:5309
潦:5310
潭:5311
潮:5312
潯:5313
潰:5314
潴:5315
潺:5316
潼:5317
潾:5318
澀:5319
澁:5320
澂:5321
澄:5322
澆:5323
澇:5324
澈:5325
澍:5326
澎:5327
澗:5328
澜:5329
澠:5330
澡:5331
澤:5332
澧:5333
澪:5334
澮:5335
澱:5336
澳:5337
澶:5338
澹:5339
激:5340
濁:5341
濂:5342
濃:5343
濉:5344
濊:5345
濑:5346
濒:5347
濕:5348
濘:5349
濛:5350
濞:5351
濟:5352
濠:5353
濡:5354
濤:5355
濫:5356
濬:5357
濮:5358
濯:5359
濰:5360
濱:5361
濵:5362
濺:5363
濾:5364
瀅:5365
瀆:5366
瀉:5367
瀋:5368
瀏:5369
瀑:5370
瀕:5371
瀘:5372
瀚:5373
瀛:5374
瀝:5375
瀞:5376
瀟:5377
瀧:5378
瀨:5379
瀬:5380
瀰:5381
瀾:5382
灃:5383
灌:5384
灏:5385
灑:5386
灕:5387
灘:5388
灝:5389
灞:5390
灣:5391
灤:5392
火:5393
灭:5394
灯:5395
灰:5396
灵:5397
灶:5398
灸:5399
灼:5400
災:5401
灾:5402
灿:5403
炀:5404
炁:5405
炅:5406
炆:5407
炉:5408
炊:5409
炎:5410
炒:5411
炔:5412
炕:5413
炖:5414
炘:5415
炙:5416
炜:5417
炤:5418
炫:5419
炬:5420
炭:5421
炮:5422
炯:5423
炱:5424
炳:5425
炸:5426
点:5427
為:5428
炼:5429
炽:5430
烁:5431
烂:5432
烃:5433
烈:5434
烏:5435
烘:5436
烙:5437
烛:5438
烜:5439
烝:5440
烟:5441
烤:5442
烦:5443
烧:5444
烨:5445
烩:5446
烫:5447
烬:5448
热:5449
烯:5450
烴:5451
烷:5452
烹:5453
烺:5454
烽:5455
焉:5456
焊:5457
焓:5458
焔:5459
焕:5460
焗:5461
焘:5462
焙:5463
焚:5464
焜:5465
無:5466
焦:5467
焯:5468
焰:5469
焱:5470
然:5471
焼:5472
煇:5473
煉:5474
煊:5475
煌:5476
煎:5477
煒:5478
煕:5479
煖:5480
煙:5481
煚:5482
煜:5483
煞:5484
煤:5485
煥:5486
煦:5487
照:5488
煨:5489
煩:5490
煬:5491
煮:5492
煲:5493
煽:5494
熄:5495
熈:5496
熊:5497
熏:5498
熒:5499
熔:5500
熙:5501
熟:5502
熠:5503
熨:5504
熬:5505
熱:5506
熲:5507
熵:5508
熹:5509
熾:5510
燁:5511
燃:5512
燄:5513
燈:5514
燉:5515
燊:5516
燎:5517
燐:5518
燒:5519
燔:5520
燕:5521
燗:5522
燙:5523
營:5524
燥:5525
燦:5526
燧:5527
燬:5528
燭:5529
燮:5530
燴:5531
燹:5532
燻:5533
燼:5534
燾:5535
燿:5536
爀:5537
爆:5538
爍:5539
爐:5540
爛:5541
爨:5542
爪:5543
爬:5544
爭:5545
爰:5546
爱:5547
爲:5548
爵:5549
父:5550
爷:5551
爸:5552
爹:5553
爺:5554
爻:5555
爽:5556
爾:5557
牂:5558
牆:5559
片:5560
版:5561
牌:5562
牍:5563
牒:5564
牘:5565
牙:5566
牛:5567
牝:5568
牟:5569
牠:5570
牡:5571
牢:5572
牧:5573
物:5574
牯:5575
牲:5576
牴:5577
牵:5578
特:5579
牺:5580
牻:5581
牽:5582
犀:5583
犁:5584
犂:5585
犄:5586
犊:5587
犍:5588
犒:5589
犛:5590
犠:5591
犢:5592
犧:5593
犬:5594
犯:5595
犰:5596
状:5597
犷:5598
犸:5599
犹:5600
犽:5601
狀:5602
狂:5603
狄:5604
狈:5605
狍:5606
狎:5607
狐:5608
狒:5609
狗:5610
狙:5611
狛:5612
狠:5613
狡:5614
狨:5615
狩:5616
独:5617
狭:5618
狮:5619
狱:5620
狳:5621
狷:5622
狸:5623
狹:5624
狼:5625
狽:5626
猁:5627
猊:5628
猎:5629
猕:5630
猖:5631
猗:5632
猛:5633
猜:5634
猝:5635
猞:5636
猟:5637
猥:5638
猩:5639
猪:5640
猫:5641
猬:5642
献:5643
猴:5644
猶:5645
猷:5646
猾:5647
猿:5648
獁:5649
獄:5650
獅:5651
獎:5652
獏:5653
獐:5654
獒:5655
獗:5656
獠:5657
獣:5658
獨:5659
獬:5660
獭:5661
獰:5662
獲:5663
獴:5664
獵:5665
獷:5666
獸:5667
獺:5668
獻:5669
獼:5670
獾:5671
玄:5672
玆:5673
率:5674
玉:5675
王:5676
玑:5677
玕:5678
玖:5679
玘:5680
玛:5681
玟:5682
玠:5683
玢:5684
玥:5685
玩:5686
玫:5687
玮:5688
环:5689
现:5690
玲:5691
玳:5692
玷:5693
玹:5694
玺:5695
玻:5696
珀:5697
珂:5698
珅:5699
珈:5700
珉:5701
珊:5702
珍:5703
珏:5704
珐:5705
珑:5706
珙:5707
珝:5708
珞:5709
珠:5710
珣:5711
珥:5712
珦:5713
珩:5714
珪:5715
班:5716
珮:5717
珲:5718
珺:5719
珽:5720
現:5721
球:5722
琅:5723
理:5724
琇:5725
琉:5726
琊:5727
琍:5728
琏:5729
琐:5730
琚:5731
琛:5732
琢:5733
琤:5734
琥:5735
琦:5736
琨:5737
琪:5738
琬:5739
琮:5740
琯:5741
琰:5742
琲:5743
琳:5744
琴:5745
琵:5746
琶:5747
琺:5748
琼:5749
琿:5750
瑀:5751
瑁:5752
瑄:5753
瑈:5754
瑊:5755
瑋:5756
瑕:5757
瑗:5758
瑙:5759
瑚:5760
瑛:5761
瑜:5762
瑞:5763
瑟:5764
瑠:5765
瑢:5766
瑣:5767
瑤:5768
瑩:5769
瑪:5770
瑭:5771
瑯:5772
瑰:5773
瑱:5774
瑳:5775
瑶:5776
瑷:5777
瑾:5778
璀:5779
璁:5780
璃:5781
璆:5782
璇:5783
璈:5784
璉:5785
璋:5786
璐:5787
璘:5788
璜:5789
璞:5790
璟:5791
璠:5792
璣:5793
璥:5794
璦:5795
璧:5796
璨:5797
璩:5798
璪:5799
環:5800
璲:5801
璹:5802
璽:5803
璿:5804
瓊:5805
瓌:5806
瓏:5807
瓒:5808
瓔:5809
瓘:5810
瓚:5811
瓛:5812
瓜:5813
瓠:5814
瓢:5815
瓣:5816
瓦:5817
瓩:5818
瓮:5819
瓯:5820
瓶:5821
瓷:5822
甄:5823
甌:5824
甑:5825
甕:5826
甘:5827
甚:5828
甜:5829
生:5830
甡:5831
產:5832
産:5833
甥:5834
甦:5835
用:5836
甩:5837
甫:5838
甬:5839
甯:5840
田:5841
由:5842
甲:5843
申:5844
电:5845
男:5846
甸:5847
町:5848
画:5849
甾:5850
畀:5851
畅:5852
畈:5853
畋:5854
界:5855
畏:5856
畑:5857
畔:5858
留:5859
畜:5860
畝:5861
畠:5862
畢:5863
畤:5864
略:5865
畦:5866
番:5867
畫:5868
畬:5869
畯:5870
異:5871
畲:5872
畳:5873
畴:5874
畵:5875
當:5876
畷:5877
畸:5878
畹:5879
畿:5880
疃:5881
疆:5882
疇:5883
疊:5884
疋:5885
疍:5886
疎:5887
疏:5888
疑:5889
疒:5890
疗:5891
疙:5892
疚:5893
疝:5894
疟:5895
疡:5896
疣:5897
疤:5898
疥:5899
疫:5900
疮:5901
疯:5902
疱:5903
疲:5904
疵:5905
疸:5906
疹:5907
疼:5908
疽:5909
疾:5910
痂:5911
病:5912
症:5913
痉:5914
痊:5915
痍:5916
痒:5917
痔:5918
痕:5919
痘:5920
痙:5921
痛:5922
痞:5923
痢:5924
痣:5925
痤:5926
痩:5927
痪:5928
痫:5929
痰:5930
痲:5931
痴:5932
痹:5933
痺:5934
瘀:5935
瘁:5936
瘋:5937
瘍:5938
瘓:5939
瘙:5940
瘟:5941
瘠:5942
瘡:5943
瘢:5944
瘤:5945
瘦:5946
瘧:5947
瘩:5948
瘫:5949
瘴:5950
瘾:5951
療:5952
癇:5953
癌:5954
癒:5955
癖:5956
癡:5957
癢:5958
癣:5959
癥:5960
癩:5961
癪:5962
癫:5963
癬:5964
癮:5965
癱:5966
癲:5967
癸:5968
発:5969
登:5970
發:5971
白:5972
百:5973
皂:5974
的:5975
皆:5976
皇:5977
皈:5978
皋:5979
皎:5980
皐:5981
皓:5982
皖:5983
皙:5984
皝:5985
皮:5986
皰:5987
皱:5988
皺:5989
皿:5990
盂:5991
盃:5992
盅:5993
盆:5994
盈:5995
益:5996
盎:5997
盏:5998
盐:5999
监:6000
盒:6001
盔:6002
盖:6003
盗:6004
盘:6005
盛:6006
盜:6007
盞:6008
盟:6009
盡:6010
監:6011
盤:6012
盥:6013
盧:6014
盩:6015
盪:6016
目:6017
盯:6018
盱:6019
盲:6020
直:6021
相:6022
盼:6023
盾:6024
省:6025
眈:6026
眉:6027
看:6028
県:6029
眙:6030
眞:6031
真:6032
眠:6033
眨:6034
眩:6035
眭:6036
眶:6037
眷:6038
眸:6039
眺:6040
眼:6041
眾:6042
着:6043
睁:6044
睇:6045
睐:6046
睑:6047
睛:6048
睜:6049
睞:6050
睡:6051
睢:6052
督:6053
睦:6054
睨:6055
睪:6056
睫:6057
睬:6058
睹:6059
睺:6060
睽:6061
睾:6062
睿:6063
瞄:6064
瞋:6065
瞌:6066
瞎:6067
瞑:6068
瞒:6069
瞞:6070
瞥:6071
瞧:6072
瞩:6073
瞪:6074
瞬:6075
瞭:6076
瞰:6077
瞳:6078
瞻:6079
瞼:6080
瞽:6081
瞿:6082
矇:6083
矍:6084
矗:6085
矚:6086
矛:6087
矜:6088
矢:6089
矣:6090
知:6091
矧:6092
矩:6093
矫:6094
短:6095
矮:6096
矯:6097
石:6098
矶:6099
矽:6100
矾:6101
矿:6102
砀:6103
码:6104
砂:6105
砌:6106
砍:6107
砒:6108
研:6109
砕:6110
砖:6111
砚:6112
砜:6113
砥:6114
砦:6115
砧:6116
砬:6117
砭:6118
砰:6119
砲:6120
破:6121
砵:6122
砷:6123
砸:6124
砺:6125
砾:6126
砿:6127
础:6128
硃:6129
硅:6130
硏:6131
硐:6132
硒:6133
硕:6134
硖:6135
硝:6136
硤:6137
硫:6138
硬:6139
确:6140
硯:6141
硼:6142
碁:6143
碇:6144
碉:6145
碌:6146
碍:6147
碎:6148
碑:6149
碓:6150
碕:6151
碗:6152
碘:6153
碚:6154
碛:6155
碟:6156
碣:6157
碧:6158
碩:6159
碭:6160
碰:6161
碱:6162
碲:6163
碳:6164
碴:6165
碶:6166
碸:6167
確:6168
碼:6169
碾:6170
磁:6171
磅:6172
磊:6173
磋:6174
磐:6175
磔:6176
磕:6177
磘:6178
磚:6179
磡:6180
磧:6181
磨:6182
磬:6183
磯:6184
磴:6185
磷:6186
磺:6187
磻:6188
磾:6189
礁:6190
礎:6191
礒:6192
礙:6193
礦:6194
礪:6195
礫:6196
礬:6197
礴:6198
示:6199
礼:6200
礽:6201
社:6202
祀:6203
祁:6204
祂:6205
祆:6206
祇:6207
祈:6208
祉:6209
祎:6210
祏:6211
祐:6212
祓:6213
祔:6214
祕:6215
祖:6216
祗:6217
祚:6218
祛:6219
祜:6220
祝:6221
神:6222
祟:6223
祠:6224
祢:6225
祥:6226
票:6227
祭:6228
祯:6229
祷:6230
祸:6231
祺:6232
祿:6233
禀:6234
禁:6235
禄:6236
禅:6237
禊:6238
禍:6239
禎:6240
福:6241
禑:6242
禔:6243
禕:6244
禛:6245
禦:6246
禧:6247
禩:6248
禪:6249
禮:6250
禰:6251
禱:6252
禹:6253
禺:6254
离:6255
禽:6256
禾:6257
禿:6258
秀:6259
私:6260
秃:6261
秆:6262
秉:6263
秋:6264
种:6265
科:6266
秒:6267
秘:6268
租:6269
秣:6270
秤:6271
秦:6272
秧:6273
秩:6274
秭:6275
积:6276
称:6277
秸:6278
移:6279
秽:6280
稀:6281
稃:6282
稅:6283
稈:6284
程:6285
稍:6286
税:6287
稔:6288
稗:6289
稙:6290
稚:6291
稜:6292
稟:6293
稠:6294
稣:6295
種:6296
稱:6297
稲:6298
稳:6299
稷:6300
稹:6301
稻:6302
稼:6303
稽:6304
稿:6305
穀:6306
穂:6307
穆:6308
穌:6309
積:6310
穎:6311
穏:6312
穐:6313
穗:6314
穢:6315
穣:6316
穩:6317
穫:6318
穰:6319
穴:6320
究:6321
穷:6322
穹:6323
空:6324
穿:6325
突:6326
窃:6327
窄:6328
窈:6329
窍:6330
窑:6331
窒:6332
窓:6333
窕:6334
窖:6335
窗:6336
窘:6337
窜:6338
窝:6339
窟:6340
窠:6341
窣:6342
窥:6343
窦:6344
窩:6345
窪:6346
窮:6347
窯:6348
窺:6349
窿:6350
竄:6351
竅:6352
竇:6353
竈:6354
竊:6355
立:6356
竑:6357
竖:6358
站:6359
竜:6360
竝:6361
竞:6362
竟:6363
章:6364
竣:6365
童:6366
竦:6367
竪:6368
竭:6369
端:6370
競:6371
竹:6372
竺:6373
竿:6374
笃:6375
笄:6376
笆:6377
笈:6378
笋:6379
笏:6380
笑:6381
笔:6382
笕:6383
笙:6384
笛:6385
笞:6386
笠:6387
笥:6388
符:6389
笨:6390
笪:6391
第:6392
笮:6393
笳:6394
笹:6395
笺:6396
笼:6397
筅:6398
筆:6399
筈:6400
等:6401
筊:6402
筋:6403
筌:6404
筍:6405
筏:6406
筐:6407
筑:6408
筒:6409
答:6410
策:6411
筛:6412
筝:6413
筠:6414
筥:6415
筧:6416
筮:6417
筰:6418
筱:6419
筲:6420
筵:6421
筷:6422
筹:6423
筺:6424
签:6425
简:6426
箇:6427
箋:6428
箍:6429
箏:6430
箐:6431
箒:6432
箓:6433
箔:6434
箕:6435
算:6436
箚:6437
箝:6438
管:6439
箪:6440
箫:6441
箬:6442
箭:6443
箱:6444
箴:6445
箸:6446
節:6447
篁:6448
範:6449
篆:6450
篇:6451
築:6452
篋:6453
篙:6454
篝:6455
篠:6456
篡:6457
篤:6458
篦:6459
篩:6460
篪:6461
篭:6462
篮:6463
篱:6464
篷:6465
篾:6466
簀:6467
簃:6468
簇:6469
簋:6470
簑:6471
簒:6472
簕:6473
簗:6474
簡:6475
簧:6476
簪:6477
簫:6478
簷:6479
簸:6480
簽:6481
簾:6482
簿:6483
籀:6484
籁:6485
籃:6486
籌:6487
籍:6488
籐:6489
籓:6490
籔:6491
籙:6492
籟:6493
籠:6494
籤:6495
籬:6496
籲:6497
米:6498
类:6499
籽:6500
籾:6501
粁:6502
粂:6503
粄:6504
粉:6505
粋:6506
粍:6507
粑:6508
粒:6509
粕:6510
粗:6511
粘:6512
粛:6513
粟:6514
粤:6515
粥:6516
粧:6517
粪:6518
粮:6519
粱:6520
粲:6521
粳:6522
粵:6523
粹:6524
粽:6525
精:6526
粿:6527
糀:6528
糅:6529
糊:6530
糍:6531
糎:6532
糕:6533
糖:6534
糗:6535
糙:6536
糜:6537
糞:6538
糟:6539
糠:6540
糧:6541
糬:6542
糯:6543
糰:6544
糸:6545
糹:6546
糺:6547
系:6548
糾:6549
紀:6550
紂:6551
約:6552
紅:6553
紆:6554
紇:6555
紉:6556
紊:6557
紋:6558
納:6559
紐:6560
紓:6561
純:6562
紗:6563
紘:6564
紙:6565
級:6566
紛:6567
紜:6568
素:6569
紡:6570
索:6571
紧:6572
紫:6573
紬:6574
紮:6575
累:6576
細:6577
紳:6578
紹:6579
紺:6580
終:6581
絃:6582
組:6583
絅:6584
絆:6585
経:6586
結:6587
絕:6588
絜:6589
絞:6590
絡:6591
絢:6592
絣:6593
給:6594
絨:6595
絮:6596
統:6597
絲:6598
絳:6599
絵:6600
絶:6601
絹:6602
綁:6603
綃:6604
綉:6605
綏:6606
綑:6607
經:6608
継:6609
続:6610
綜:6611
綝:6612
綠:6613
綢:6614
綦:6615
綫:6616
綬:6617
維:6618
綰:6619
綱:6620
網:6621
綴:6622
綵:6623
綸:6624
綺:6625
綻:6626
綽:6627
綾:6628
綿:6629
緊:6630
緋:6631
総:6632
緑:6633
緒:6634
緖:6635
緘:6636
線:6637
緝:6638
緞:6639
締:6640
緡:6641
緣:6642
編:6643
緩:6644
緬:6645
緯:6646
緲:6647
練:6648
緹:6649
緻:6650
縁:6651
縄:6652
縈:6653
縉:6654
縊:6655
縛:6656
縝:6657
縞:6658
縣:6659
縦:6660
縫:6661
縮:6662
縯:6663
縱:6664
縷:6665
縹:6666
縻:6667
總:6668
績:6669
繁:6670
繃:6671
繆:6672
繇:6673
繊:6674
繋:6675
繍:6676
繒:6677
織:6678
繕:6679
繙:6680
繚:6681
繞:6682
繡:6683
繩:6684
繪:6685
繫:6686
繭:6687
繰:6688
繳:6689
繹:6690
繼:6691
繽:6692
纂:6693
纈:6694
續:6695
纍:6696
纏:6697
纓:6698
纖:6699
纘:6700
纛:6701
纜:6702
纠:6703
红:6704
纣:6705
纤:6706
纥:6707
约:6708
级:6709
纪:6710
纫:6711
纬:6712
纭:6713
纮:6714
纯:6715
纱:6716
纲:6717
纳:6718
纵:6719
纶:6720
纷:6721
纸:6722
纹:6723
纺:6724
纽:6725
纾:6726
线:6727
绀:6728
绂:6729
练:6730
组:6731
绅:6732
细:6733
织:6734
终:6735
绊:6736
绍:6737
绎:6738
经:6739
绑:6740
绒:6741
结:6742
绕:6743
绘:6744
给:6745
绚:6746
绛:6747
络:6748
绝:6749
绞:6750
统:6751
绡:6752
绢:6753
绣:6754
绥:6755
继:6756
绩:6757
绪:6758
绫:6759
续:6760
绮:6761
绯:6762
绰:6763
绳:6764
维:6765
绵:6766
绶:6767
绷:6768
绸:6769
综:6770
绽:6771
绾:6772
绿:6773
缀:6774
缄:6775
缅:6776
缆:6777
缇:6778
缉:6779
缎:6780
缓:6781
缔:6782
缕:6783
编:6784
缘:6785
缙:6786
缚:6787
缜:6788
缝:6789
缟:6790
缠:6791
缢:6792
缤:6793
缨:6794
缩:6795
缪:6796
缬:6797
缭:6798
缮:6799
缯:6800
缴:6801
缵:6802
缶:6803
缸:6804
缺:6805
缽:6806
罂:6807
罄:6808
罅:6809
罈:6810
罌:6811
罐:6812
网:6813
罔:6814
罕:6815
罗:6816
罘:6817
罚:6818
罟:6819
罠:6820
罡:6821
罢:6822
罩:6823
罪:6824
置:6825
罰:6826
署:6827
罵:6828
罷:6829
罹:6830
罽:6831
羁:6832
羅:6833
羆:6834
羈:6835
羊:6836
羋:6837
羌:6838
美:6839
羔:6840
羚:6841
羞:6842
羟:6843
羡:6844
羣:6845
群:6846
羥:6847
羧:6848
羨:6849
義:6850
羯:6851
羰:6852
羲:6853
羸:6854
羹:6855
羽:6856
羿:6857
翀:6858
翁:6859
翅:6860
翊:6861
翌:6862
翎:6863
習:6864
翔:6865
翕:6866
翘:6867
翟:6868
翠:6869
翡:6870
翥:6871
翦:6872
翩:6873
翫:6874
翮:6875
翰:6876
翱:6877
翳:6878
翹:6879
翻:6880
翼:6881
耀:6882
老:6883
考:6884
者:6885
耆:6886
而:6887
耍:6888
耐:6889
耒:6890
耕:6891
耗:6892
耘:6893
耙:6894
耜:6895
耦:6896
耨:6897
耳:6898
耶:6899
耸:6900
耻:6901
耽:6902
耿:6903
聂:6904
聃:6905
聆:6906
聊:6907
聋:6908
职:6909
联:6910
聖:6911
聘:6912
聚:6913
聞:6914
聡:6915
聪:6916
聯:6917
聰:6918
聲:6919
聳:6920
聴:6921
聶:6922
職:6923
聽:6924
聾:6925
聿:6926
肃:6927
肄:6928
肅:6929
肆:6930
肇:6931
肉:6932
肋:6933
肌:6934
肓:6935
肖:6936
肘:6937
肚:6938
肛:6939
肜:6940
肝:6941
肟:6942
肠:6943
股:6944
肢:6945
肤:6946
肥:6947
肩:6948
肪:6949
肮:6950
肯:6951
肱:6952
育:6953
肴:6954
肺:6955
肼:6956
肽:6957
肾:6958
肿:6959
胀:6960
胁:6961
胃:6962
胄:6963
胆:6964
背:6965
胍:6966
胎:6967
胖:6968
胚:6969
胛:6970
胜:6971
胝:6972
胞:6973
胡:6974
胤:6975
胥:6976
胧:6977
胪:6978
胫:6979
胭:6980
胯:6981
胰:6982
胱:6983
胳:6984
胴:6985
胶:6986
胸:6987
胺:6988
胼:6989
能:6990
脂:6991
脅:6992
脆:6993
脇:6994
脈:6995
脉:6996
脊:6997
脍:6998
脏:6999
脐:7000
脑:7001
脓:7002
脖:7003
脚:7004
脛:7005
脣:7006
脩:7007
脫:7008
脯:7009
脱:7010
脲:7011
脳:7012
脷:7013
脸:7014
脹:7015
脾:7016
腆:7017
腈:7018
腊:7019
腋:7020
腌:7021
腎:7022
腐:7023
腑:7024
腓:7025
腔:7026
腕:7027
腥:7028
腦:7029
腩:7030
腫:7031
腭:7032
腮:7033
腰:7034
腱:7035
腳:7036
腴:7037
腸:7038
腹:7039
腺:7040
腻:7041
腾:7042
腿:7043
膀:7044
膂:7045
膈:7046
膊:7047
膏:7048
膑:7049
膚:7050
膛:7051
膜:7052
膝:7053
膠:7054
膣:7055
膦:7056
膨:7057
膩:7058
膳:7059
膵:7060
膺:7061
膽:7062
膾:7063
膿:7064
臀:7065
臂:7066
臆:7067
臈:7068
臉:7069
臍:7070
臏:7071
臓:7072
臘:7073
臚:7074
臟:7075
臣:7076
臥:7077
臧:7078
臨:7079
自:7080
臬:7081
臭:7082
至:7083
致:7084
臺:7085
臻:7086
臼:7087
臾:7088
舁:7089
舂:7090
舅:7091
舆:7092
與:7093
興:7094
舉:7095
舊:7096
舌:7097
舍:7098
舎:7099
舐:7100
舒:7101
舔:7102
舖:7103
舗:7104
舘:7105
舛:7106
舜:7107
舞:7108
舟:7109
舢:7110
舩:7111
航:7112
舫:7113
般:7114
舯:7115
舰:7116
舱:7117
舳:7118
舵:7119
舶:7120
舷:7121
舸:7122
船:7123
舺:7124
舾:7125
艀:7126
艇:7127
艉:7128
艋:7129
艏:7130
艘:7131
艙:7132
艛:7133
艤:7134
艦:7135
艮:7136
良:7137
艰:7138
艱:7139
色:7140
艳:7141
艶:7142
艷:7143
艸:7144
艹:7145
艺:7146
艾:7147
节:7148
芃:7149
芈:7150
芊:7151
芋:7152
芍:7153
芎:7154
芒:7155
芗:7156
芙:7157
芜:7158
芝:7159
芡:7160
芥:7161
芦:7162
芨:7163
芩:7164
芪:7165
芫:7166
芬:7167
芭:7168
芮:7169
芯:7170
花:7171
芳:7172
芷:7173
芸:7174
芹:7175
芻:7176
芽:7177
芾:7178
苄:7179
苅:7180
苇:7181
苋:7182
苌:7183
苍:7184
苎:7185
苏:7186
苑:7187
苓:7188
苔:7189
苕:7190
苗:7191
苛:7192
苜:7193
苞:7194
苟:7195
苡:7196
苣:7197
若:7198
苦:7199
苧:7200
苫:7201
苯:7202
英:7203
苳:7204
苴:7205
苷:7206
苹:7207
苺:7208
苻:7209
苾:7210
茁:7211
茂:7212
范:7213
茄:7214
茅:7215
茉:7216
茌:7217
茎:7218
茔:7219
茗:7220
茛:7221
茜:7222
茧:7223
茨:7224
茫:7225
茯:7226
茱:7227
茲:7228
茴:7229
茵:7230
茶:7231
茸:7232
茹:7233
荀:7234
荃:7235
荆:7236
草:7237
荊:7238
荏:7239
荐:7240
荒:7241
荔:7242
荖:7243
荘:7244
荚:7245
荞:7246
荟:7247
荠:7248
荡:7249
荣:7250
荤:7251
荥:7252
荧:7253
荨:7254
荩:7255
荪:7256
荫:7257
药:7258
荳:7259
荷:7260
荸:7261
荻:7262
荼:7263
荽:7264
莅:7265
莆:7266
莉:7267
莊:7268
莎:7269
莒:7270
莓:7271
莖:7272
莘:7273
莞:7274
莠:7275
莢:7276
莧:7277
莨:7278
莪:7279
莫:7280
莱:7281
莲:7282
莳:7283
莴:7284
获:7285
莹:7286
莺:7287
莽:7288
莿:7289
菀:7290
菁:7291
菅:7292
菇:7293
菈:7294
菊:7295
菌:7296
菏:7297
菓:7298
菖:7299
菘:7300
菜:7301
菝:7302
菟:7303
菠:7304
菡:7305
菩:7306
菫:7307
華:7308
菰:7309
菱:7310
菲:7311
菴:7312
菸:7313
菽:7314
萁:7315
萃:7316
萄:7317
萇:7318
萊:7319
萌:7320
萍:7321
萎:7322
萘:7323
萜:7324
萝:7325
萠:7326
萣:7327
萤:7328
营:7329
萦:7330
萧:7331
萨:7332
萩:7333
萬:7334
萱:7335
萵:7336
萸:7337
萼:7338
落:7339
葆:7340
葉:7341
葎:7342
著:7343
葛:7344
葜:7345
葡:7346
董:7347
葦:7348
葩:7349
葫:7350
葬:7351
葭:7352
葯:7353
葱:7354
葳:7355
葵:7356
葶:7357
葷:7358
葺:7359
蒂:7360
蒋:7361
蒐:7362
蒔:7363
蒙:7364
蒜:7365
蒞:7366
蒟:7367
蒡:7368
蒨:7369
蒯:7370
蒲:7371
蒴:7372
蒸:7373
蒺:7374
蒻:7375
蒼:7376
蒽:7377
蒾:7378
蒿:7379
蓀:7380
蓁:7381
蓄:7382
蓆:7383
蓉:7384
蓋:7385
蓍:7386
蓑:7387
蓓:7388
蓖:7389
蓝:7390
蓟:7391
蓣:7392
蓬:7393
蓮:7394
蓼:7395
蓿:7396
蔀:7397
蔑:7398
蔓:7399
蔔:7400
蔗:7401
蔘:7402
蔚:7403
蔡:7404
蔣:7405
蔥:7406
蔦:7407
蔬:7408
蔭:7409
蔴:7410
蔵:7411
蔷:7412
蔺:7413
蔻:7414
蔼:7415
蔽:7416
蕁:7417
蕃:7418
蕈:7419
蕉:7420
蕊:7421
蕎:7422
蕗:7423
蕙:7424
蕤:7425
蕨:7426
蕩:7427
蕪:7428
蕭:7429
蕲:7430
蕴:7431
蕷:7432
蕾:7433
薀:7434
薄:7435
薇:7436
薈:7437
薊:7438
薌:7439
薏:7440
薑:7441
薔:7442
薗:7443
薙:7444
薛:7445
薜:7446
薦:7447
薨:7448
薩:7449
薪:7450
薫:7451
薬:7452
薮:7453
薯:7454
薰:7455
薷:7456
薹:7457
薺:7458
藁:7459
藉:7460
藍:7461
藎:7462
藏:7463
藐:7464
藓:7465
藔:7466
藕:7467
藜:7468
藝:7469
藤:7470
藥:7471
藨:7472
藩:7473
藪:7474
藷:7475
藹:7476
藺:7477
藻:7478
藿:7479
蘂:7480
蘄:7481
蘅:7482
蘆:7483
蘇:7484
蘊:7485
蘋:7486
蘑:7487
蘚:7488
蘭:7489
蘸:7490
蘿:7491
虎:7492
虏:7493
虐:7494
虑:7495
虓:7496
虔:7497
處:7498
虚:7499
虛:7500
虜:7501
虞:7502
號:7503
虢:7504
虧:7505
虫:7506
虬:7507
虯:7508
虱:7509
虹:7510
虻:7511
虽:7512
虾:7513
蚀:7514
蚁:7515
蚂:7516
蚊:7517
蚋:7518
蚌:7519
蚓:7520
蚕:7521
蚜:7522
蚝:7523
蚣:7524
蚤:7525
蚩:7526
蚪:7527
蚬:7528
蚯:7529
蚱:7530
蚵:7531
蚶:7532
蚺:7533
蛀:7534
蛄:7535
蛆:7536
蛇:7537
蛉:7538
蛊:7539
蛋:7540
蛍:7541
蛎:7542
蛏:7543
蛔:7544
蛙:7545
蛛:7546
蛞:7547
蛟:7548
蛤:7549
蛭:7550
蛮:7551
蛯:7552
蛰:7553
蛱:7554
蛳:7555
蛸:7556
蛹:7557
蛺:7558
蛻:7559
蛾:7560
蜀:7561
蜂:7562
蜃:7563
蜆:7564
蜈:7565
蜉:7566
蜊:7567
蜍:7568
蜑:7569
蜒:7570
蜓:7571
蜕:7572
蜗:7573
蜘:7574
蜚:7575
蜜:7576
蜡:7577
蜢:7578
蜥:7579
蜱:7580
蜴:7581
蜷:7582
蜻:7583
蜿:7584
蝇:7585
蝉:7586
蝋:7587
蝌:7588
蝎:7589
蝓:7590
蝕:7591
蝗:7592
蝙:7593
蝟:7594
蝠:7595
蝣:7596
蝦:7597
蝨:7598
蝮:7599
蝰:7600
蝴:7601
蝶:7602
蝸:7603
蝽:7604
蝾:7605
蝿:7606
螂:7607
螃:7608
螄:7609
螈:7610
融:7611
螞:7612
螟:7613
螢:7614
螨:7615
螫:7616
螭:7617
螯:7618
螳:7619
螺:7620
螽:7621
蟀:7622
蟄:7623
蟆:7624
蟇:7625
蟋:7626
蟎:7627
蟑:7628
蟒:7629
蟜:7630
蟠:7631
蟬:7632
蟲:7633
蟷:7634
蟹:7635
蟻:7636
蟾:7637
蠅:7638
蠊:7639
蠍:7640
蠑:7641
蠔:7642
蠕:7643
蠟:7644
蠡:7645
蠢:7646
蠣:7647
蠱:7648
蠲:7649
蠵:7650
蠶:7651
蠹:7652
蠻:7653
血:7654
衅:7655
衆:7656
衊:7657
行:7658
衍:7659
衒:7660
術:7661
衔:7662
衕:7663
街:7664
衙:7665
衚:7666
衛:7667
衝:7668
衞:7669
衡:7670
衢:7671
衣:7672
补:7673
表:7674
衫:7675
衬:7676
衮:7677
衰:7678
衷:7679
衹:7680
衽:7681
衾:7682
衿:7683
袁:7684
袂:7685
袄:7686
袈:7687
袋:7688
袍:7689
袒:7690
袖:7691
袛:7692
袜:7693
袞:7694
袢:7695
袤:7696
被:7697
袭:7698
袱:7699
袴:7700
裁:7701
裂:7702
装:7703
裏:7704
裒:7705
裔:7706
裕:7707
裘:7708
裙:7709
補:7710
裝:7711
裟:7712
裡:7713
裤:7714
裨:7715
裱:7716
裳:7717
裴:7718
裵:7719
裸:7720
裹:7721
製:7722
裾:7723
褂:7724
複:7725
褌:7726
褐:7727
褒:7728
褓:7729
褔:7730
褚:7731
褥:7732
褪:7733
褫:7734
褲:7735
褶:7736
褻:7737
襁:7738
襄:7739
襖:7740
襞:7741
襟:7742
襦:7743
襪:7744
襯:7745
襲:7746
襷:7747
西:7748
要:7749
覃:7750
覆:7751
覇:7752
見:7753
規:7754
覓:7755
視:7756
覗:7757
覚:7758
覦:7759
覧:7760
親:7761
覬:7762
覲:7763
観:7764
覺:7765
覽:7766
觀:7767
见:7768
观:7769
规:7770
觅:7771
视:7772
览:7773
觉:7774
觊:7775
觎:7776
觐:7777
角:7778
觚:7779
觞:7780
解:7781
触:7782
觴:7783
觸:7784
言:7785
訁:7786
訂:7787
訃:7788
訇:7789
計:7790
訊:7791
訌:7792
討:7793
訓:7794
訕:7795
訖:7796
託:7797
記:7798
訛:7799
訝:7800
訟:7801
訢:7802
訣:7803
訥:7804
訪:7805
設:7806
許:7807
訳:7808
訴:7809
訶:7810
診:7811
註:7812
証:7813
訾:7814
詁:7815
詆:7816
詈:7817
詐:7818
詒:7819
詔:7820
評:7821
詛:7822
詞:7823
詠:7824
詡:7825
詢:7826
詣:7827
試:7828
詧:7829
詩:7830
詫:7831
詬:7832
詭:7833
詮:7834
詰:7835
話:7836
該:7837
詳:7838
詵:7839
詹:7840
詼:7841
誅:7842
誇:7843
誉:7844
誊:7845
誌:7846
認:7847
誑:7848
誓:7849
誕:7850
誘:7851
語:7852
誠:7853
誡:7854
誣:7855
誤:7856
誥:7857
誦:7858
誨:7859
說:7860
説:7861
読:7862
誰:7863
課:7864
誹:7865
誼:7866
誾:7867
調:7868
諂:7869
諄:7870
談:7871
請:7872
諌:7873
諍:7874
諏:7875
諒:7876
論:7877
諛:7878
諜:7879
諡:7880
諤:7881
諦:7882
諧:7883
諫:7884
諭:7885
諮:7886
諱:7887
諲:7888
諳:7889
諴:7890
諶:7891
諷:7892
諸:7893
諺:7894
諾:7895
謀:7896
謁:7897
謂:7898
謄:7899
謇:7900
謊:7901
謎:7902
謐:7903
謔:7904
謖:7905
謗:7906
謙:7907
謚:7908
講:7909
謝:7910
謠:7911
謡:7912
謨:7913
謫:7914
謬:7915
謳:7916
謹:7917
謾:7918
譁:7919
證:7920
譏:7921
識:7922
譙:7923
譚:7924
譜:7925
警:7926
譬:7927
譯:7928
議:7929
譲:7930
譴:7931
護:7932
譽:7933
讀:7934
讃:7935
變:7936
讎:7937
讐:7938
讒:7939
讓:7940
讖:7941
讚:7942
讞:7943
计:7944
订:7945
讣:7946
认:7947
讥:7948
讦:7949
讧:7950
讨:7951
让:7952
讪:7953
讫:7954
训:7955
议:7956
讯:7957
记:7958
讲:7959
讳:7960
讴:7961
讶:7962
讷:7963
许:7964
讹:7965
论:7966
讼:7967
讽:7968
设:7969
访:7970
诀:7971
证:7972
诂:7973
诃:7974
评:7975
诅:7976
识:7977
诈:7978
诉:7979
诊:7980
诋:7981
词:7982
诏:7983
译:7984
诒:7985
试:7986
诗:7987
诘:7988
诙:7989
诚:7990
诛:7991
诜:7992
话:7993
诞:7994
诟:7995
诠:7996
诡:7997
询:7998
诣:7999
诤:8000
该:8001
详:8002
诧:8003
诩:8004
诫:8005
诬:8006
语:8007
误:8008
诰:8009
诱:8010
诲:8011
说:8012
诵:8013
请:8014
诸:8015
诹:8016
诺:8017
读:8018
诽:8019
课:8020
谀:8021
谁:8022
调:8023
谄:8024
谅:8025
谈:8026
谊:8027
谋:8028
谌:8029
谍:8030
谎:8031
谏:8032
谐:8033
谑:8034
谒:8035
谓:8036
谔:8037
谕:8038
谗:8039
谘:8040
谙:8041
谚:8042
谛:8043
谜:8044
谟:8045
谢:8046
谣:8047
谤:8048
谥:8049
谦:8050
谧:8051
谨:8052
谩:8053
谪:8054
谬:8055
谭:8056
谯:8057
谱:8058
谳:8059
谴:8060
谶:8061
谷:8062
谿:8063
豁:8064
豆:8065
豈:8066
豉:8067
豊:8068
豌:8069
豎:8070
豐:8071
豔:8072
豕:8073
豚:8074
象:8075
豢:8076
豨:8077
豪:8078
豫:8079
豬:8080
豳:8081
豸:8082
豹:8083
豺:8084
貂:8085
貉:8086
貊:8087
貌:8088
貓:8089
貘:8090
貝:8091
貞:8092
負:8093
財:8094
貢:8095
貧:8096
貨:8097
販:8098
貪:8099
貫:8100
責:8101
貯:8102
貰:8103
貳:8104
貴:8105
貶:8106
買:8107
貸:8108
費:8109
貼:8110
貽:8111
貿:8112
賀:8113
賁:8114
賂:8115
賃:8116
賄:8117
資:8118
賈:8119
賊:8120
賎:8121
賑:8122
賓:8123
賚:8124
賛:8125
賜:8126
賞:8127
賠:8128
賡:8129
賢:8130
賣:8131
賤:8132
賦:8133
質:8134
賬:8135
賭:8136
賴:8137
賺:8138
購:8139
賽:8140
賾:8141
贄:8142
贅:8143
贇:8144
贈:8145
贊:8146
贋:8147
贍:8148
贏:8149
贓:8150
贔:8151
贖:8152
贛:8153
贝:8154
贞:8155
负:8156
贡:8157
财:8158
责:8159
贤:8160
败:8161
账:8162
货:8163
质:8164
贩:8165
贪:8166
贫:8167
贬:8168
购:8169
贮:8170
贯:8171
贰:8172
贱:8173
贲:8174
贴:8175
贵:8176
贷:8177
贸:8178
费:8179
贺:8180
贻:8181
贼:8182
贽:8183
贾:8184
贿:8185
赀:8186
赁:8187
赂:8188
赃:8189
资:8190
赈:8191
赉:8192
赋:8193
赌:8194
赍:8195
赎:8196
赏:8197
赐:8198
赓:8199
赔:8200
赖:8201
赘:8202
赚:8203
赛:8204
赝:8205
赞:8206
赟:8207
赠:8208
赡:8209
赢:8210
赣:8211
赤:8212
赦:8213
赧:8214
赫:8215
赭:8216
走:8217
赳:8218
赴:8219
赵:8220
赶:8221
起:8222
趁:8223
超:8224
越:8225
趋:8226
趕:8227
趙:8228
趟:8229
趣:8230
趨:8231
足:8232
趴:8233
趸:8234
趺:8235
趾:8236
跃:8237
跆:8238
跋:8239
跌:8240
跏:8241
跑:8242
跖:8243
跗:8244
跛:8245
距:8246
跟:8247
跡:8248
跤:8249
跨:8250
跪:8251
路:8252
跳:8253
践:8254
跷:8255
跸:8256
跻:8257
踊:8258
踏:8259
踐:8260
踝:8261
踞:8262
踢:8263
踩:8264
踪:8265
踰:8266
踴:8267
踵:8268
踹:8269
蹂:8270
蹄:8271
蹇:8272
蹈:8273
蹉:8274
蹊:8275
蹋:8276
蹕:8277
蹙:8278
蹟:8279
蹠:8280
蹤:8281
蹦:8282
蹬:8283
蹲:8284
蹴:8285
蹶:8286
蹺:8287
蹼:8288
躁:8289
躄:8290
躅:8291
躇:8292
躉:8293
躊:8294
躋:8295
躍:8296
躏:8297
躑:8298
躓:8299
躙:8300
躪:8301
身:8302
躬:8303
躯:8304
躰:8305
躲:8306
躺:8307
躾:8308
軀:8309
車:8310
軋:8311
軌:8312
軍:8313
軒:8314
軔:8315
軛:8316
軟:8317
転:8318
軫:8319
軸:8320
軻:8321
軼:8322
軽:8323
軾:8324
較:8325
輅:8326
載:8327
輋:8328
輌:8329
輒:8330
輓:8331
輔:8332
輕:8333
輛:8334
輜:8335
輝:8336
輟:8337
輥:8338
輦:8339
輩:8340
輪:8341
輯:8342
輳:8343
輸:8344
輻:8345
輾:8346
輿:8347
轂:8348
轄:8349
轅:8350
轆:8351
轉:8352
轍:8353
轎:8354
轟:8355
轡:8356
轢:8357
轤:8358
车:8359
轧:8360
轨:8361
轩:8362
轫:8363
转:8364
轭:8365
轮:8366
软:8367
轰:8368
轲:8369
轴:8370
轶:8371
轸:8372
轻:8373
轼:8374
载:8375
轿:8376
辂:8377
较:8378
辄:8379
辅:8380
辆:8381
辇:8382
辈:8383
辉:8384
辊:8385
辍:8386
辎:8387
辐:8388
辑:8389
输:8390
辕:8391
辖:8392
辗:8393
辘:8394
辙:8395
辛:8396
辜:8397
辞:8398
辟:8399
辣:8400
辦:8401
辨:8402
辩:8403
辫:8404
辭:8405
辮:8406
辯:8407
辰:8408
辱:8409
農:8410
辶:8411
边:8412
辺:8413
辻:8414
込:8415
辽:8416
达:8417
辿:8418
迁:8419
迂:8420
迄:8421
迅:8422
过:8423
迈:8424
迎:8425
运:8426
近:8427
返:8428
还:8429
这:8430
进:8431
远:8432
违:8433
连:8434
迟:8435
迢:8436
迤:8437
迥:8438
迦:8439
迨:8440
迩:8441
迪:8442
迫:8443
迭:8444
述:8445
迳:8446
迴:8447
迷:8448
迸:8449
迹:8450
迺:8451
追:8452
退:8453
送:8454
适:8455
逃:8456
逄:8457
逅:8458
逆:8459
选:8460
逊:8461
逋:8462
逍:8463
透:8464
逐:8465
逑:8466
递:8467
逓:8468
途:8469
逕:8470
逖:8471
逗:8472
這:8473
通:8474
逛:8475
逝:8476
逞:8477
速:8478
造:8479
逡:8480
逢:8481
連:8482
逮:8483
逯:8484
週:8485
進:8486
逵:8487
逸:8488
逹:8489
逻:8490
逼:8491
逾:8492
遁:8493
遂:8494
遅:8495
遇:8496
遊:8497
運:8498
遍:8499
過:8500
遏:8501
遐:8502
遑:8503
遒:8504
道:8505
達:8506
違:8507
遗:8508
遘:8509
遙:8510
遜:8511
遞:8512
遠:8513
遡:8514
遣:8515
遥:8516
遨:8517
適:8518
遭:8519
遮:8520
遲:8521
遴:8522
遵:8523
遶:8524
遷:8525
選:8526
遹:8527
遺:8528
遼:8529
遽:8530
避:8531
邀:8532
邁:8533
邂:8534
邃:8535
還:8536
邇:8537
邈:8538
邉:8539
邊:8540
邏:8541
邑:8542
邓:8543
邕:8544
邗:8545
邙:8546
邛:8547
邝:8548
邠:8549
邡:8550
邢:8551
那:8552
邦:8553
邨:8554
邪:8555
邬:8556
邮:8557
邯:8558
邰:8559
邱:8560
邳:8561
邴:8562
邵:8563
邸:8564
邹:8565
邺:8566
邻:8567
邽:8568
邾:8569
郁:8570
郃:8571
郅:8572
郇:8573
郊:8574
郎:8575
郑:8576
郓:8577
郕:8578
郗:8579
郛:8580
郜:8581
郝:8582
郞:8583
郡:8584
郢:8585
郤:8586
郦:8587
郧:8588
部:8589
郫:8590
郭:8591
郯:8592
郴:8593
郵:8594
郷:8595
郸:8596
都:8597
郾:8598
郿:8599
鄂:8600
鄄:8601
鄆:8602
鄉:8603
鄒:8604
鄔:8605
鄕:8606
鄖:8607
鄙:8608
鄚:8609
鄜:8610
鄞:8611
鄠:8612
鄢:8613
鄣:8614
鄧:8615
鄭:8616
鄯:8617
鄰:8618
鄱:8619
鄲:8620
鄴:8621
鄺:8622
酆:8623
酈:8624
酉:8625
酊:8626
酋:8627
酌:8628
配:8629
酎:8630
酐:8631
酒:8632
酔:8633
酗:8634
酚:8635
酝:8636
酞:8637
酢:8638
酣:8639
酥:8640
酩:8641
酪:8642
酬:8643
酮:8644
酯:8645
酰:8646
酱:8647
酵:8648
酶:8649
酷:8650
酸:8651
酿:8652
醃:8653
醇:8654
醉:8655
醋:8656
醌:8657
醍:8658
醐:8659
醒:8660
醗:8661
醚:8662
醛:8663
醜:8664
醞:8665
醣:8666
醤:8667
醪:8668
醫:8669
醬:8670
醮:8671
醯:8672
醴:8673
醸:8674
醺:8675
釀:8676
釁:8677
采:8678
釈:8679
釉:8680
释:8681
釋:8682
里:8683
重:8684
野:8685
量:8686
釐:8687
金:8688
釔:8689
釗:8690
釘:8691
釜:8692
針:8693
釣:8694
釤:8695
釧:8696
釩:8697
釵:8698
釷:8699
鈀:8700
鈉:8701
鈍:8702
鈎:8703
鈐:8704
鈑:8705
鈔:8706
鈕:8707
鈞:8708
鈣:8709
鈦:8710
鈮:8711
鈰:8712
鈴:8713
鈷:8714
鈸:8715
鈹:8716
鈺:8717
鈽:8718
鈾:8719
鈿:8720
鉀:8721
鉄:8722
鉅:8723
鉈:8724
鉉:8725
鉋:8726
鉍:8727
鉏:8728
鉑:8729
鉗:8730
鉚:8731
鉛:8732
鉞:8733
鉢:8734
鉤:8735
鉦:8736
鉬:8737
鉭:8738
鉱:8739
鉴:8740
鉸:8741
鉻:8742
鉾:8743
銀:8744
銃:8745
銅:8746
銑:8747
銓:8748
銕:8749
銖:8750
銘:8751
銚:8752
銛:8753
銜:8754
銣:8755
銥:8756
銦:8757
銨:8758
銫:8759
銬:8760
銭:8761
