{
  "_name_or_path": "cisco-ai/mini-bart-g2p",
  "activation_dropout": 0.1,
  "activation_function": "gelu",
  "add_cross_attention": true,
  "architectures": [
    "BartForConditionalGeneration"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": 0.0,
  "cross_attention_hidden_size": 256,
  "d_model": 256,
  "decoder_attention_heads": 4,
  "decoder_ffn_dim": 512,
  "decoder_layerdrop": 0.1,
  "decoder_layers": 3,
  "decoder_start_token_id": 2,
  "dropout": 0.3,
  "encoder_attention_heads": 4,
  "encoder_ffn_dim": 512,
  "encoder_layerdrop": 0.1,
  "encoder_layers": 3,
  "eos_token_id": 2,
  "forced_eos_token_id": 2,
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1",
    "2": "LABEL_2"
  },
  "init_std": 0.02,
  "is_encoder_decoder": true,
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1,
    "LABEL_2": 2
  },
  "max_position_embeddings": 128,
  "model_type": "bart",
  "num_hidden_layers": 3,
  "pad_token_id": 1,
  "scale_embedding": true,
  "transformers_version": "4.46.3",
  "use_cache": true,
  "vocab_size": 103
}
